{"_id":{"$oid":"5d0ed9c4c191272ec02e78b9"},"ingredients":["2 pounds chicken wings","1 1/2 teaspoons salt","1/4 cup maple syrup","1/4 cup light brown sugar","2 tablespoons Sriracha-style hot sauce"],"directions":["Preheat the oven to 425°F","Line a large baking sheet with aluminum foil and place a roasting rack on top. Cover the rack with another sheet of foil and spray with nonstick cooking spray. Use a knife to poke holes all over the foil","Pat the chicken wings dry with paper towels","Season the chicken wings on both sides with salt","Place the maple syrup, brown sugar, and Sriracha in a large mixing bowl. Whisk to combine. For spicier chicken wings, add an additional tablespoon of Sriracha","Place the chicken wings in the bowl. Using a rubber spatula, toss the wings to coat in the maple-Sriracha glaze","Arrange the chicken wings on the foil-covered roasting rack. Spoon any remaining maple-Sriracha glaze over the chicken wings","Bake the chicken wings for 45-50 minutes, until browned and crisp","Check to see that chicken wings are done (the chicken's internal temperature should read 165°F). Remove from oven or add time as needed","Allow the chicken wings to cool on the roasting rack for 3 minutes. Transfer the chicken wings to a plate and serve immediately"],"source":"https://www.yummly.com/recipe/Sweet-_-Spicy-Maple-Sriracha-Baked-Chicken-Wings-2650370","tags":["Glazing","Wings","browning","Drying","Baking"],"label":"Sweet \u0026 Spicy Maple-Sriracha Baked Chicken Wings","image":"https://lh3.googleusercontent.com/1aFNdXr82hRrhyCJAqTd4O8wfc0YaOiJl5DMclqHuE9FD5ElEkeKDlr1oe9Z5AXmRJG4pOl0RvKDbRb5mYulA_s=s320-c-rw-v1-e365","description":"Partly sweet, partly spicy, these oven-baked chicken wings are tossed in a glaze of maple syrup, brown sugar, and Sriracha sauce that makes them simply addicting.","prepTime":52,"servings":2,"dateCreated":{"$date":"2019-06-23T01:45:40.750Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0ed9f1c191272ec02e78bb"},"ingredients":["5/8 cup rolled oats","1/2 cup espresso ","1/2 cup unsweetened almond milk","2 3/8 tablespoons blueberries","1/3 banana","2 teaspoons peanut butter","1 teaspoon chia seeds"],"directions":["Mix rolled oats with Califia Farms xx espresso and unsweetened almond (can refrigerate overnight or serve immediately)","Top with sliced banana, peanut butter and blueberries. Sprinkle with chia seeds"],"tags":["Easy","Breakfast and Brunch","Quick and Easy","Quick"],"label":"California Breakfast Bowl","image":"https://lh3.googleusercontent.com/ZxSDSVowRryF0gOUnHFN8GDLjcCd4CL9KNwHt5GcnJ9a67EkNhtgYjUNR9eocGvaS9reSymuseN6fna_YkPiYPQ=s320-c-rw-v1-e365","description":"Brighten your morning with this delicious plant-based breakfast bowl","prepTime":15,"servings":1,"source":"https://www.yummly.com/recipe/California-Breakfast-Bowl-2191733","dateCreated":{"$date":"2019-06-23T01:46:25.310Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0ed9ffc191272ec02e78bc"},"ingredients":["6 eggs","2 cups milk","1/2 cup half and half","1 teaspoon vanilla extract","2 tablespoons orange juice","1/2 teaspoon ground nutmeg","1/4 teaspoon salt","1 loaf french bread","4 tablespoons butter","1/2 cup brown sugar"],"directions":["Mix eggs, milk, half and half, vanilla extract, orange juice, nutmeg, and salt in a bowl until thoroughly combined. Lay the bread on a high rimmed baking sheet in one layer. Pour the egg and milk mixture over the bread ensuring all pieces are covered. Cover with plastic wrap and place in the fridge overnight. Flip bread pieces at least once either before bed or an hour before baking in the morning.","Preheat oven to 350F. Mix together melted butter and brown sugar in a small bowl. Put parchment paper on another baking sheet and spread out the brown sugar mixture evenly. Lay pieces of bread on the brown sugar ensuring each piece is covered","Bake for 20 minutes. Flip pieces of bread and bake for another 5 minutes or until the brown sugar is bubbly","Serve warm and enjoy! Top with powdered sugar and fruit"],"tags":["Easy","French Toast","Low Sodium","Breakfast and Brunch","Browning","Low Calorie","Baking"],"label":"Creme Brulee French Toast","image":"https://lh3.googleusercontent.com/OWe0Pl5A5-_8kRI0FsxTm6P4r-oXiN-mCgdxNBRTfHaOhw5BBNnNsMKlF9yrmduJXQdqKYBeF6Y1Z2XIE87smQ=s320-c-rw-v1-e365","description":"You’re going to need to try this Creme Brulee French Toast as soon as you can. It’s decadent and rich and perfect to impress whoever you’re looking to impress","prepTime":780,"servings":10,"source":"https://www.yummly.com/recipe/Creme-Brulee-French-Toast-2660269","dateCreated":{"$date":"2019-06-23T01:46:39.460Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda0dc191272ec02e78bd"},"ingredients":["1 pound ground beef","1 yellow onion","1 tablespoon taco seasoning","2 cups enchilada sauce","8 tortillas","1 cup shredded cheddar cheese","1 cup shredded Monterey Jack cheese"],"directions":["Preheat oven to 350 degrees","Heat a large skillet over medium-high heat","Add ground beef, onion and taco seasoning; cook until meat is no longer pink","Drain fat from beef and onion mixture","Grate cheeses into a large bowl and combine","Pour about 1/2 cup of enchilada sauce into the baking dish to cover the bottom","Lay tortilla on a flat surface and spoon ground beef mixture down the middle, top with about 1/8 cup of cheese","Roll up tortilla and place, seam side down, in the baking dish","Repeat with remaining tortillas","Top enchiladas with remaining enchilada sauce and cheese","Bake for 15-20 minutes or until heat through and cheese has melted"],"tags":["Enchiladas","Mexican","Quick","Main Dishes","High Fiber"],"label":"The Best Ground Beef Enchiladas","image":"https://lh3.googleusercontent.com/XS51cRoZOzxbUwAdLS7PCvx57IDf7SRokpsUmrYnb5_gRYT7OjbCkTuCHGpnhwp-drX4OsG4gDaeeiDhE-bJzA=s320-c-rw-v1-e365","description":"These are the best Ground Beef Enchiladas!  They are ready in about 30 minutes and my family goes crazy for them every time","prepTime":30,"servings":2,"source":"https://www.yummly.com/recipe/The-Best-Ground-Beef-Enchiladas-2552052","dateCreated":{"$date":"2019-06-23T01:46:53.038Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda16c191272ec02e78be"},"ingredients":["2 large eggs","3 slices bacon","3 cups collard greens","1/4 teaspoon black pepper","1/2 teaspoon pink salt","1/4 teaspoon garlic powder","1/2 tablespoon ghee"],"directions":["Heat a large skillet to medium-high heat and slice up the bacon into pieces. Add the bacon to the hot pan and allow to cook down","Once the bacon is cooked to your liking add in the collard greens and season with garlic powder, salt and pepper. Cook the collards down to your liking and then transfer bacon and collards to a bowl","Add the ghee to the hot pan and crack in the eggs. Let them fry up until the white is fully cooked through and season them with salt and pepper. Once the eggs are cooked add them to your bowl and enjoy!"],"tags":["Quick","Frying","Easy","Low Sugar","Low Carb","Low Calories"],"label":"Keto Diet Breakfast Bowl","image":"https://lh3.googleusercontent.com/XNZNANfBv420SM29WwFIEZj58_B7oxWPioa2zZfqpQtZjRju5Z-DBRoplN02rWBip5Gkle1ufsFysJlbbfVz=s320-c-rw-v1-e365","description":"Keto Diet Breakfast Bowl! It's high in healthy fats, low in carbs, and will keep satisfied all throughout the busy day","prepTime":5,"servings":4,"source":"https://www.yummly.com/recipe/Keto-Diet-Breakfast-Bowl-2646307","dateCreated":{"$date":"2019-06-23T01:47:02.383Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda1fc191272ec02e78bf"},"ingredients":["2 pounds bone in chicken thighs","4 unsalted butter","1 tablespoon Cajun seasonings","1 tablespoon honey","1 teaspoon salt","3 dashes cayenne pepper"],"directions":["Debone the chicken thighs but leave the skin on","In a small bowl, add the melted butter, Cajun Seasonings, honey, salt and cayenne pepper together. Stir to mix well","Add the chicken and Cajun butter mixture together. Marinate the chicken for 30 minutes","Preheat oven to 400F. Transfer the Cajun-marinated chicken to a baking dish. Bake for 20-25 minutes or until the chicken is cooked through and the skin starts to brown. Broil the skin for 10 seconds or so, until they are nicely charred","Transfer the chicken and the Cajun chicken sauce in the baking dish to a serving platter. Spoon the sauce over the chicken. Slice the chicken into pieces and serve immediately"],"tags":["Marinating","Main Dishes","Easy","Cajun \u0026 Creole"],"label":"Cajun Chicken","image":"https://lh3.googleusercontent.com/v_Egp9rpLJ8Im7_-BSCAtztPa29KJKmLhvNoIjwKUIl6WUB85Yjp0wjtA0P0rFgWWqN03N4JPYIkQEu10for3w=s320-c-rw-v1-e365","description":"Cajun Chicken - moist, juicy, tender Cajun baked chicken with crispy skin. This Cajun Chicken recipe takes only 10 mins active time. So delicious!","prepTime":35,"servings":4,"source":"https://www.yummly.com/recipe/Cajun-Chicken-2607621","dateCreated":{"$date":"2019-06-23T01:47:11.665Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda2ac191272ec02e78c0"},"ingredients":["2 pounds chicken breasts","2/3 cup italian dressing","1/2 minced garlic","1/2 tablespoon chili powder","1/2 tablespoon ground cumin","1 package ranch dressing mix","1/2 cup water"],"directions":["Place chicken breasts in the bottom of your Instant Pot","In a small bowl combine Italian dressing, minced garlic, chili powder, cumin, ranch dressing mix and water","Place the lid on the pot and set to the lock or SEAL position","Turn the Instant Pot to the MANUAL setting for 12 minutes if your chicken is frozen, or 8 minutes if it’s not frozen","When the timer goes off allow the pressure to naturally release for about 15 minutes before removing lid","Remove chicken from the pot, shred","Use for tacos, burritos, enchiladas, nachos, salads, etc"],"tags":["Quick","Main Dishes","Easy","Quick and Easy"],"label":"Instant Pot Cafe Rio Chicken","image":"https://lh3.googleusercontent.com/GJE4X6-FJRLqmP4WTWmjVeSQ_8d28uAgvTpcuyepfi5gGnVePGAFLZKZXsjoHjOv7lQhg2KvRY8RyH1RmD0O=s320-c-rw-v1-e365","description":"Instant Pot and slow cooker have been lifesavers this summer. There have been so many hot nights where I have not wanted to turn my oven on","prepTime":30,"servings":4,"source":"https://www.yummly.com/recipe/Instant-Pot-Cafe-Rio-Chicken-2435324","dateCreated":{"$date":"2019-06-23T01:47:22.052Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda39c191272ec02e78c1"},"ingredients":["8 ounces pasta","2 tablespoons olive oil","2 cups asparagus spears","2 garlic cloves","1 cup snap peas","1 cup frozen peas","1 tablespoon lemon juice","3 cups chicken stock","1 cup skim milk","1 cup cherry tomatoes","1/2 cup grated parmesan cheese"],"directions":["In a large skillet, heat olive oil over medium high heat. Add asparagus spears and sauté for 5 minutes","Add garlic, snap peas and lemon juice to the pan and sauté for 1 minute, until garlic is fragrant","Add pasta, chicken stock and skim milk. Stir to combine and bring to a boil. Reduce to a simmer, add frozen peas, cover and cook for about 6 minutes, or until al dente","When pasta is cooked, add parmesan cheese and cherry tomatoes. Stir to combine and serve immediately"],"tags":["Primavera","Sauteening","Quick","Main Dishes","Low Sodium","Low Calories"," Boiling"],"label":"One Pot Spring Pasta Primavera","image":"https://lh3.googleusercontent.com/h0zcMk8l0ZQPDS0stHNhz_QaMuXe5BGH6j5CgZiRqItKF0hGRU6qrLhY5roFBIbFvJ-9AgGUs2L_b8u1RmjsJNM=s320-c-rw-v1-e365","description":"one pot dish that only takes 15 minutes to make so I can go outside and enjoy the fresh air. Ergo: One Pot Spring Pasta Primavera","prepTime":20,"servings":5,"source":"https://www.yummly.com/recipe/One-Pot-Spring-Pasta-Primavera-1571346","dateCreated":{"$date":"2019-06-23T01:47:37.532Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda4cc191272ec02e78c2"},"ingredients":["1 pound sweet potatoes","1 tablespoon olive oil","1/2 teaspoon salt","black pepper"],"directions":["Preheat the oven to 425° F","Line a large baking sheet with parchment paper","With a sharp knife, cut the sweet potatoes into wedges approximately 3/4” thick","Place the sweet potatoes in a large mixing bowl. Drizzle with olive oil. Sprinkle with salt and black pepper, to taste","Use a rubber spatula to toss the sweet potatoes until they are evenly coated in the oil. Arrange the sweet potatoes on the baking sheet, spreading them out as much as possible","Transfer the baking sheet to the middle rack of the preheated oven","Roast for 12 minutes","Open the oven door. Flip the sweet potatoes","Continue roasting for 10-14 minutes longer, until the sweet potatoes are tender and slightly charred at the edges","Remove the sweet potatoes from the oven, and serve immediately"],"tags":["Side Dishes","Quick and Easy","Fries","Roasting","Quick","Easy"],"label":"Baked Sweet Potato Fries","image":"https://lh3.googleusercontent.com/tKpATaiU2iIqJ_6bdy7IMAXbWYc-AkqFPc-c7s1oeu8t96QA4FZUNcJdvROcSNcYoZfxxW7J_jjY0PqOI_33s6o=s320-c-rw-v1-e365","description":"weet potatoes are totally underrated, don’t you think? Besides being inexpensive, they’re loaded with nutrients, high in fiber, and incredibly filling. From mashed to roasted, to fried, there’s really no way to mess up a sweet potato. We’re partial to this baked sweet potato fries recipe, ourselves. Easy, delicious, and nutrient-dense – what more could you want from these tasty tubers?","prepTime":29,"servings":1,"source":"https://www.yummly.com/recipe/Baked-Sweet-Potato-Fries-2430943","dateCreated":{"$date":"2019-06-23T01:47:56.264Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda64c191272ec02e78c3"},"ingredients":["1 1/2 tablespoons olive oil","1/2 cup onion","3 garlic cloves","2 cups sliced mushrooms","15 ounces chickpeas","1/2 cup sun dried tomatoes","1 teaspoon fine sea salt","1/4 teaspoon white pepper","1 tablespoon herbs","2 tablespoons vegetarian Worcestershire sauce","1 cup breadcrumbs","2 eggs","olive oil"],"directions":["In a large skillet, heat olive oil over medium heat. Add onion and cook for 2 minutes. Add garlic and sliced mushrooms, cook for an additional 5-7 minutes until brown and tender. Remove from heat and set aside","In a food processor, add chickpeas, sun-dried tomatoes, sea salt, white pepper, Italian herb blend, and Worcestershire sauce. Pulse 2-3 times until a very coarse mixture forms","Add mushroom mixture and continue pulsing as a more uniform coarse mixture forms. Add breadcrumbs and continue to pulse until incorporated.  Taste test and add additional salt as needed. Stir in whisked eggs until incorporated. Form 1 – 1 ½ inch balls, you’ll get about 18-20 meatballs","Coat a skillet (I use my cast iron) in ¼ inch flavorless oil or olive oil and heat over medium heat. Add meatballs to heated oil, being sure to not crowd the pan. Cook 1-2 minutes on each side, until golden brown. Continue cooking in batches until all meatballs are cooked. *See baking option below","erve with your favorite tomato sauce as desired."],"tags":["Low Sugar","Quick","Main Dishes","Browning","Low Calories"],"label":"Super Savory Vegetarian “Meatballs”","image":"https://lh3.googleusercontent.com/569HzFy1DtHgKYfHTizJGHdXbqekCSsekSFKunMjnEr6i2OIgQ0naIkQmUbDR7tDksU24ItcGdsA8nLlGM7h67U=s320-c-rw-v1-e365","description":"The best vegetarian meatballs – with excellent texture and all the umami-ness you need, they have the classic meatball taste without the meat! Perfect as an appetizer for a party or a quick weeknight dinner!","prepTime":30,"servings":5,"source":"https://www.yummly.com/recipe/Super-Savory-Vegetarian-Meatballs-2633682","dateCreated":{"$date":"2019-06-23T01:48:20.267Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda70c191272ec02e78c4"},"ingredients":["1 1/2 pounds eggplant","2 teaspoons kosher salt","4 tablespoons extra-virgin olive oil","freshly ground black pepper","1 teaspoon Italian parsley leaves","1/2 teaspoon red wine vinegar","1 pinch red pepper flakes","56 ounces whole peeled tomatoes","1/4 cup extra-virgin olive oil","1 yellow onion","2 garlic cloves","1 tablespoon tomato paste","1 bay leaf","1/4 teaspoon red pepper flakes","kosher salt","2 tablespoons capers","kosher salt","12 ounces lasagna noodles","2 pounds soft tofu","1/3 cup Italian parsley leaves","3 tablespoons nutritional yeast","2 teaspoons grated lemon zest","2 tablespoons lemon juice","2 teaspoons kosher salt","1/2 teaspoon freshly ground black pepper","1 cup basil leaves"],"directions":["Heat the oven to 350°F and arrange a rack in the middle","Cut the eggplant(s) lengthwise into 1/8-inch-thick slices. Place in a single layer on a flat surface or 2 baking sheets, overlapping slightly as needed, and sprinkle evenly with 1 teaspoon of the salt. Flip the eggplant and sprinkle evenly with the remaining 1 teaspoon salt; let sit until water beads form on the surface, at least 30 minutes. Meanwhile, prepare the sauce","Using a food processor fitted with a blade attachment, pulse the tomatoes and their juices, in batches as needed, until coarsely chopped (about 10 pulses). Heat the oil in a large saucepan with a tightfitting lid over medium-high heat until shimmering. Add the onion and cook, stirring occasionally, until translucent, about 3 minutes. Add the garlic and cook until fragrant, about 30 seconds more","Push the onions and garlic to one side of the pan and add the tomato paste to the empty side of the pan. Cook the paste slightly to remove the raw flavor, stirring occasionally, about 1 to 2 minutes. Stir the onions and garlic into the paste to incorporate. Add the chopped tomatoes, bay leaf, red pepper flakes, and a few pinches of salt. Bring the mixture to a boil, then reduce the heat to low, cover, and simmer for 45 minutes to meld the flavors","Add the capers, taste, and season with additional salt and red pepper flakes as needed; set aside","Using paper towels, pat the eggplant slices dry on both sides. In a large nonstick frying pan, heat 1 1/2 teaspoons of the oil over medium-high heat. Add just enough eggplant to sit in a single layer in the pan and sear on both sides, about 4 minutes total. Taste and season with salt and pepper as needed. Transfer to a plate and repeat, in batches, with another 1 1/2 tablespoons of the oil and the remaining uncooked eggplant","While the eggplant cooks, place the remaining 2 tablespoons olive oil, parsley, vinegar, red pepper flakes, and a pinch of salt in a large bowl and stir to combine. Transfer the seared eggplant to the oil-vinegar mixture and toss. Taste and season with additional salt as needed","Bring a large pot of heavily salted water to a boil over medium-high heat. Add the noodles and cook, stirring occasionally, until al dente, about 7 minutes. Drain. When cool enough to handle, lay the pieces flat on a lightly oiled baking sheet","Place the tofu, parsley, nutritional yeast (if using), lemon zest, lemon juice, and measured salt and pepper in the bowl of a food processor fitted with a blade attachment and process until smooth, about 30 seconds. Taste and season with more lemon juice, salt, and pepper as needed; set aside","Spread a thin layer of tomato sauce in the bottom of a 13-by-9-inch baking dish. Place a single layer of noodles on top of the sauce, about 3 regular-sized noodles. Top the noodles with a quarter of the tofu filling (about 1 cup) and spread evenly. Lay a quarter of the eggplant slices over the filling. Spread about 1 cup of sauce over the eggplant and sprinkle with about 1/4 cup of the basil leaves. Make three more layers of noodles, filling, eggplant, sauce, and basil, omitting the basil from the top layer","Cover with foil and bake for 50 minutes. Uncover and bake until bubbling, about 10 minutes more. Let cool at least 10 minutes before cutting. Sprinkle with the remaining 1/4 cup basil. Serve with any remaining tomato sauce"],"tags":["Italian","Low Sugar","Lasagna","Baking","Main Dishes","Oven","Low Carb","Low Calorie"],"label":"Vegan Lasagna","image":"https://lh3.googleusercontent.com/N2DKVSmrhX3sPVGA-xDAOW-Bzc7ceeS6Qgm6Cbtesnnsj06r0sfJE_8HRabwIvN7YfUt6k8E6UFPC6AfYGDO8A=s320-c-rw-v1-e365","description":"it’s a delicious and healthy pasta dish that is bound to also please the meat- and dairy-lovers among us","prepTime":180,"servings":10,"source":"https://www.yummly.com/recipe/Vegan-Lasagna-505082","dateCreated":{"$date":"2019-06-23T01:48:32.653Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda7ac191272ec02e78c5"},"ingredients":["1/2 cup oats","3/4 cup almond milk","1 teaspoon maple syrup","1 teaspoon pure vanilla extract"],"directions":["In any glass container with a tight seal lid, add milk, maple syrup, vanilla and oats; stir well with a spoon. If you would like to add toppings in the morning, use bigger jars. If you want to use smaller jars (pictured), add scant (1-2 tbsp less) of milk and oats, so jars don’t overflow","Refrigerate overnight. When ready to eat, stir and top with favourite toppings: nuts, berries, fruit, coconut flakes etc. If overnight oatmeal is too thick, adjust with milk. Also add more maple syrup if desired"],"tags":["Quick and Easy","Low Sodium","Breakfast and Brunch","Quick","Easy","Low Sugar","Low Carb","Low Calories","Low Fat"],"label":"Overnight Oats","image":"https://lh3.googleusercontent.com/RIKiQB9bLUGSr5hQVvYmQtBsuHqPuYtTLt6nsl2sfiNqht1Oa-cuh8HjvGBcRfvWHR8bOCI3pzDFUIaWAorVfg=s320-c-rw-v1-e365","description":"Overnight oatmeal are raw oats mixed with milk and soaked overnight. Hence, the name. Milk soften the oats eliminating the need to cook oatmeal on the stove","prepTime":15,"servings":4,"source":"https://www.yummly.com/recipe/Super-Savory-Vegetarian-Meatballs-2633682","dateCreated":{"$date":"2019-06-23T01:48:42.514Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda81c191272ec02e78c6"},"ingredients":["2 pounds beef stew meat","7/8 ounce brown gravy mix","1 ounce au jus mix","1 cup water","12 ounces wide egg noodles"],"directions":["In the crock of a 4 to 6-quart slow cooker, stir together the meat, gravy mix, au jus mix, and water.  Cover and cook on low for 6 to 8 hours","Cook the noodles according to the package instructions.  Serve the noodles topped with the beef"],"tags":["Low Sugar","Slow Cooking","Main Dishes","Low Calories","Low Fat"],"label":"Slow Cooker Beef and Noodles","image":"https://lh3.googleusercontent.com/7hS9sy1_AASPAl6czHPfO4j15JCDqh_q6uQaahCb2szvfyRyRpg07cM9irUJGTv8Q8uzT6OzUDufJr7wRGhDzA=s320-c-rw-v1-e365","description":"This easy recipe for Slow Cooker Beef and Noodles is your new go-to for busy weeknight comfort food!","prepTime":35,"servings":4,"source":"https://www.yummly.com/recipe/Slow-Cooker-Beef-and-Noodles-2498260","dateCreated":{"$date":"2019-06-23T01:48:49.998Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda8cc191272ec02e78c7"},"ingredients":["1 cup strawberries (Frozen)","1 banana","1/3 cup old fashioned oats","1/2 teaspoon vanilla extract","1/2 teaspoon chia seeds","1 tablespoon honey","1 cup milk"],"directions":["Place all ingredients into blender and blend for 1-2 minutes or until all ingredients are combined and smooth","Serve immediately for best results"],"tags":["Beverages","Blending","Smoothie","Low Carb","Low Calories","Low Fat"],"label":"Strawberry Oatmeal Smoothie","image":"https://lh3.googleusercontent.com/kJNzftVFPvyfplvlMUJS_8UgKHSnq4EFNfxDBORRQyabhNGDsWjXsTW2vRogaznbaFQaiEnqOAARQnqExR4kPg=s320-c-rw-v1-e365","description":"This super simple Strawberry Oatmeal Smoothie is made with strawberries, bananas, oats and chia seeds. Packed with a ton of fiber, omega-3 fatty acids, potassium and antioxidants this smoothie has perfect staying power to fill you up all morning (or afternoon) long.","prepTime":10,"servings":4,"source":"https://www.yummly.com/recipe/Strawberry-Oatmeal-Smoothie-2649469","dateCreated":{"$date":"2019-06-23T01:49:00.258Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda95c191272ec02e78c8"},"ingredients":["2 cloves garlic","2 tablespoons sea salt","1 teaspoon cayenne pepper","2 teaspoons smoked paprika","3 tablespoons olive oil","4 teaspoons fresh lemon juice","2 pounds large shrimp","lemon wedges"],"directions":["reheat grill for medium heat","In a small bowl, crush the garlic with the salt. Mix in cayenne pepper and paprika, and then stir in olive oil and lemon juice to form a paste. In a large bowl, toss shrimp with garlic paste until evenly coated.","Lightly oil grill grate. Cook shrimp for 2 to 3 minutes per side, or until opaque. Transfer to a serving dish, garnish with lemon wedges, and serve."],"tags":["Berbecue","Quick and Easy","Main Dishes","Grilling","Quick","Easy","Low Sugar","Low Carb","Low Calories","Low Fat"],"label":"Spicy Grilled Shrimp","image":"https://lh3.googleusercontent.com/WwNcKnZClNayhzJhZ4pQyfT2Hm9v0B6kt3bK1w5nVV27DSWT0PtOVCZspSZ23iTdboqbLZpPBx6Xx0-ybDzHbQ=s320-c-rw-v1-e365","description":"So fast and easy to prepare, these shrimp are destined to be the hit of any barbeque. And, weather not permitting, they work great under the broiler, too.","prepTime":15,"servings":5,"source":"https://www.yummly.com/recipe/Spicy-Grilled-Shrimp-1081929","dateCreated":{"$date":"2019-06-23T01:49:09.964Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eda9dc191272ec02e78c9"},"ingredients":["2 ounces amaretto","3/4 ounce bourbon","1 ounce fresh lemon juice","1 ounce simple syrup","maraschino cherry","lemon peel"],"directions":["In a shaker filled with ice, add all of the ingredients and shake until chilled. Strain into an ice-filled glass. Top with a lemon peel and a cherry."],"tags":["Easy","Beverages","Cocktail"],"label":"Amaretto Sour With Bourbon","image":"https://lh5.ggpht.com/p377m1NFfY9VtlI05_-p1VH6FFXxV7u9IjYdC3_2D3SEkqjpikWbwRVUzK_HFsKin5imiOcFF7Dx7oPIi58KzSY=s320-c-rw-v1-e365","description":"Amaretto Sour With Bourbon","prepTime":10,"servings":1,"source":"https://www.yummly.com/recipe/Amaretto-Sour-With-Bourbon-2617418#12938f79-a433-4d0c-837c-f8e78a1c0cf5","dateCreated":{"$date":"2019-06-23T01:49:17.636Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edaa7c191272ec02e78ca"},"ingredients":["1 pound boneless skinless chicken breast","1/4 cup flour","1 cup chicken broth","1/4 cup honey","1/4 cup soy sauce","1/2 tablespoon fresh ginger","2 garlic cloves","2 teaspoons sesame oil","2 tablespoons cooking oil","1 1/4 pounds broccoli","1 onion","3/4 pound white button mushrooms"],"directions":["Trim chicken breast of any excess fat and pat dry with paper towels. In a medium bowl, toss chicken breast with 1/4 cup flour until evenly coated. Remove chicken to a plate (leave remaining flour in the bowl - you'll use it for the sauce)","To make the sauce: in the bowl with remaining flour used to coat the chicken, add 1 cup chicken stock, 1/4 cup honey, 1/4 cup soy sauce, 1/2 Tbsp grated ginger, 2 cloves grated garlic and 2 tsp sesame oil (if using) and stir until smooth. Set aside.","Heat a wok or large heavy-bottomed skillet on medium high heat and add 1 Tbsp olive oil. Once oil is hot, add chicken pieces and spread out evenly. Let chicken sit for a minute before stirring, then stir fry 5 minutes or until browned. Remove chicken from the pan and set aside.","Add another 1 Tbsp of oil to the same pan. Once oil is hot, add small broccoli florets, onions and sliced mushrooms to the pan and stir-fry 4 minutes, or until mushrooms are softened and broccoli is crisp-tender.","Stir the sauce again then pour it your hot vegetables. Bring to a boil over medium heat, stirring constantly. Simmer 2 minutes or until sauce is thickened then toss in chicken and cook another 30 seconds or until heated through. Season to taste with salt if needed and serve over hot rice."],"tags":["Main Dishes","Quick","Frying","Low Fat","Low Carb","Low Calorie"],"label":"Chicken Broccoli and Mushroom Stir Fry","image":"https://lh3.googleusercontent.com/N6sxRTwLMKBdTlln2jD3wbP7q3LIoLv6byI6_aLurEr1KpkMwN-WMxw-JS6RWKYKX1LJAVq6wYhA0sor7hFx=s320-c-rw-v1-e365","description":"The sauce in this broccoli chicken stir fry is perfectly “saucy,” making it ideal for serving over hot and fluffy white rice. It’s much healthier than takeout and you can use the best and even organic ingredients.","prepTime":30,"servings":6,"source":"https://www.yummly.com/recipe/Chicken-Broccoli-and-Mushroom-Stir-Fry-2177388","dateCreated":{"$date":"2019-06-23T01:49:27.286Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edaeec191272ec02e78cc"},"ingredients":["2 1/2 pounds flank steak","2 tablespoons balsamic vinegar","2 tablespoons fresh lemon juice","1 tablespoon dijon mustard","1 tablespoon worcestershire sauce","1 tablespoon garlic","dried oregano","dried basil","dried thyme","1 teaspoon paprika","cayenne pepper","1/4 cup olive oil"],"directions":["Combine balsamic vinegar, lemon juice, Dijon, Worcestershire sauce, garlic, and spices.","Then whisk in olive oil.","Trim the flank steak so there’s not a lot of visible fat. Then make small scores about 1/4 inch deep and 1/4 inch apart on both sides of the meat. (This allows the marinade to penetrate more, but it’s optional.)","Place meat in ziploc bag, using the smallest size you can fit it into.","Pour marinade mixture over meat.","Then marinate in refrigerator 8-24 hours","To cook, take meat out of the refrigerator, drain off marinade, and let it come to room temperature while you preheat grill to high heat. (I sometimes rinse the flank steak if I’m in a hurry.)","Turn grill to medium-high or let coals cool down before you put the meat on.","If using Polder Meat Thermometer, cook to a temperature to 130F. If using instant read meat thermometer, start checking temperature after you turn the meat and cook to 130F.","I turned the meat after about 6 minutes, and my flank steak reached this temperature in about 11 minutes, but cooking time will depend on how hot the grill is, the size of your steak, and the temperature of the meat when you start.","The meat will continue to cook as it rests, so it’s best to remove from the grill when it’s underdone rather than overdone.","When meat reaches that temperature remove from the grill.","Let rest 5-10 minutes for smaller pieces or 10-15 minutes for larger pieces.","Cut meat into thin slices across the grain.","Serve immediately","This is great served with Chimichurri Sauce or olive sauce for steak."],"tags":["Barbecue","Main Dishes","Grilling"],"label":"Marinated Flank Steak","image":"https://lh4.ggpht.com/WbuHWvv4ZK8VqWPndWKgYek7ok1f8YhiOcXmyp710kGT6riwvp20gA2Sob6ERwRSZwN0XRHnE2opb6TXeNfr=s320-c-rw-v1-e365","description":"Marinated and Grilled Flank Steak is a dinner that will please any beef lover, and this tasty recipe is low-carb, Keto, low-glycemic, gluten-free, South Beach Diet Phase One, and can be Paleo or Whole 30 with the right ingredients! Use the Diet-Type Index to find more recipes like this one.","prepTime":35,"servings":5,"source":"https://www.yummly.com/recipe/Marinated-flank-steak-309575","dateCreated":{"$date":"2019-06-23T01:50:38.432Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edafac191272ec02e78cd"},"ingredients":["32 ounces boneless, skinless chicken breasts","2 teaspoons olive oil","3 tablespoons brown sugar","1 tablespoon chili powder","1 teaspoon parsley flakes","1/2 teaspoon salt","1/2 teaspoon black pepper","1/2 teaspoon garlic powder","1/2 teaspoon onion powder","1/2 teaspoon cumin"],"directions":["Pre heat oven to 425 degrees F. Line a baking sheet with foil and spray with non stick spray.","Place the chicken breasts between two sheets of parchment paper and pound to an even thickness. Drizzle both sides of chicken with olive oil.","Combine seasonings and sprinkle generously over both sides of the chicken breasts. Bake for 20 minutes. Remove from oven and cover loosely with foil for 5 minutes before slicing. Enjoy!"],"tags":["Quick and Easy","Low Sodium","Baking","Main Dishes","Quick","Easy","Low Sugar","Low Carb","Low Calorie","Low Fat"],"label":"Juicy Oven Baked Chicken Breast","image":"https://lh3.googleusercontent.com/aOuR_AdEFclBEERVtlD3sAsbvGAwbYeG8tjTskXZUWt6Ft_PKVtrqvN6jbcaD48loRPyWNPkZ2B3z_rTXEyA=s320-c-rw-v1-e365","description":"Yes, it’s true, you CAN have tender and juicy white meat chicken that’s BAKED in the oven!","prepTime":25,"servings":5,"source":"https://www.yummly.com/recipe/Juicy-Oven-Baked-Chicken-Breast-2716315","dateCreated":{"$date":"2019-06-23T01:50:50.898Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb09c191272ec02e78ce"},"ingredients":["12 sea scallops","2 teaspoons all purpose flour","salt","fresh ground black pepper","2 tablespoons oil","1 1/2 tablespoons butter","2 garlic cloves","1 cup fresh basil leaves","4 lemon slices"],"directions":["Use a paper towel to pat the scallops dry. Dust one side of the scallops with a small amount of flour, and then season with salt and pepper.","Heat a wide skillet over medium-high heat. Add the oil to the pan. When the oil is hot and shimmery, carefully place the scallops, seasoned-side-down, into the pan. Cook, without moving them until browned, about 2 minutes.","While the first side is browning, dust the unseasoned side of the scallops with a bit of flour and season them with salt and pepper.","Flip the scallops — if any stick to the pan, wait a few more seconds then try again, gently wiggling them side to side to help release them.","Add the butter and garlic to the pan, and then swirl the butter around the pan as it melts. Cook another minute or two then take the pan off of the heat. Stir in the basil leaves and lemon slices. Serve."],"tags":["Drying","Quick","browning"],"label":"Seared Scallops With Garlic Basil Butter","image":"https://lh3.googleusercontent.com/G9n7Qi6jLcigGFJgYitYCIMJkEiTR_fBIHQagylQhIxoBppD3uO-aDWFyE_1a3wp1sJmJKDPjmUCA_mehaEy2CE=s320-c-rw-v1-e365","description":"These pan seared scallops with garlic basil butter take less than 10 minutes and taste incredible!","prepTime":20,"servings":4,"source":"https://www.yummly.com/recipe/Seared-Scallops-With-Garlic-Basil-Butter-2599016","dateCreated":{"$date":"2019-06-23T01:51:05.638Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb1cc191272ec02e78cf"},"ingredients":["2 pounds cod filets","2 tablespoons EVOO","1 pound grape tomatoes","1/2 cup kalamata olives","2 tablespoons capers","1 tablespoon juice","1/4 cup white wine","1 tablespoon unsalted butter","4 basil leaves"],"directions":["In a saute pan on high heat, saute cod filets in EVOO. Cook each filet for about 3 minutes on each side. Remove fish from heat.","In the same pan, saute the tomatoes for five minutes. Add the kalamata olives, capers, caper juice, and let it cook down for another five minutes","Add white wine and reduce for another five minutes. At the very end, add the butter and remove from heat.","Pour sauce over the fish, garnish with basil, and serve. Enjoy!"],"tags":["Quick and Easy","Low Sodium","Sauteeing","Main Dishes","Quick","Easy","Low Sugar","Low Carb","Low Calorie"],"label":"Mediterranean Cod","image":"https://lh3.googleusercontent.com/4Zh4PmHRSmqbi_CT4IfkDnNgUA0MIKs7XaJTlK_88XUhewRSQ9h6tqlPw4EcsjnqWNddUp6Rh3Q-EXucHCGL0Q=s320-c-rw-v1-e365","description":"This Mediterranean Cod reminds me of my time in Greece and Italy. The fresh flavor of the tomatoes combined with the brine-y flavor of the kalamata olives and capers makes for a delicious weeknight meal. Enjoy!","prepTime":25,"servings":4,"source":"https://www.yummly.com/recipe/Mediterranean-Cod-2631721","dateCreated":{"$date":"2019-06-23T01:51:24.431Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb27c191272ec02e78d0"},"ingredients":["2 cups zucchini","1 large egg","1/4 cup shredded parmesan cheese ","1/8 teaspoon black pepper","1/4 cup almond flour"],"directions":["Preheat oven to 450°F. Line a large baking sheet with parchment paper.","Add zucchini, egg, cheese, pepper and flour to a large mixing bowl. Mix until all ingredients are thoroughly combined.Add zucchini to a large bowl and let sit 10-15 minutes. Drain excess water from zucchini bowl. Using a cheesecloth or several sturdy paper towels, add in 1/2 cup of zucchini into towel and wring dry. Repeat with remaining zucchini. When you are finished, you should have about 1 cup of zucchini remaining.","Dump zucchini mixture onto baking sheet lined with parchment paper. Using a spatula, thin and spread out the batter so that it forms a round crust approximately 9 inches in diameter and 1/8 inch thick.","Bake in oven about 15-20 minutes or until edges are golden brown and both sides are cooked. Flip over crust and bake an additional 10 minutes until top is crispy. Flip pizza crust back over.","Lower oven temperature to 400°F. Add whatever pizza ingredients you desire to your crust. I did a layer of marinara sauce, followed by fresh slices of mozzarella, sliced bell peppers and fresh basil leaves. Bake for about 8-10 minutes or until cheese is melted. Serve immediately."],"tags":["Main Dishes","Pizza","Low Sugar","Browning","Low Sodium","Low Fat","Low Carb","Low Calorie","Baking"],"label":"Zucchini Crust Pizza","image":"https://lh3.googleusercontent.com/A73bKQwtga6CKmw9aGD_-9nkQnMyHfzzusq2HQDRhl7cuIVdwF5mqcofl2fsSyXRQJ7O8k1_M9s0lKlzmhBt2Q=s640-c-rw-v1-e365","description":"This low carb zucchini crust pizza is crispy, delicious and a great way to add more vegetables to your diet.","prepTime":60,"servings":4,"source":"https://www.yummly.com/recipe/Zucchini-Crust-Pizza-2690350","dateCreated":{"$date":"2019-06-23T01:51:35.555Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb3bc191272ec02e78d2"},"ingredients":["2 chicken breasts","4 ounces cheddar cheese","2 ounces jalapeno","salt","pepper","4 slices bacon"],"directions":["Start with two thawed chicken breasts and season with salt and pepper","Cover with cheese","Add Jalapenos (Optional)","Cut the bacon in half and drape over the chicken","Transfer to a foil lined pan and bake at 350 for 30-45 minutes or until done","If the chicken is done and the bacon is not, put it under the broiler for a few minutes"],"tags":["Main Dishes","Easy","Low Sugar","Broiling","Low Carb","Baking"],"label":"Lazy Keto Chicken","image":"https://lh3.googleusercontent.com/w0oK2hUVTtzMG9fJKnGtH453Cbp94n9ZnatYO87QEweVHtTvhYbNAorXBBcFsvPk8oNxU336j_spyKIYbeRqSQ=s640-c-rw-v1-e365","description":" I didn’t have a meal planned and eating out / fast food is a lot of work on keto.  Enter Lazy Keto Chicken!  In the past I’ve made complicated dishes like stuffed chicken, but I was thinking, could I make it even easier?  Its a lot of work to cut a perfect pocket into a piece of chicken and perfectly wrap it in bacon.  So instead, I decided to just layer it all and see how it went.","prepTime":55,"servings":2,"source":"https://www.yummly.com/recipe/Lazy-Keto-Chicken-2652744","dateCreated":{"$date":"2019-06-23T01:51:55.563Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb43c191272ec02e78d3"},"ingredients":["6 boneless pork chops","1/3 cup olive oil","3 1/2 tablespoons soy sauce","1 tablespoon rub"],"directions":["Add pork chops to a large zip bag","In a small bowl mix olive oil, soy sauce and rub","Add the marinade to the zip lock bag and refrigerate for 6 hours or overnight","Grill the pork over medium heat about 6 minutes per side","Watch closely for internal temp around 155F","Remove from grill, tent with foil and let rest for 5-10 minutes"],"tags":["Main Dishes","Quick and Easy","Grilling","Quick","Easy"],"label":"Grilled Pork Chops","image":"https://lh3.googleusercontent.com/wV4VnN6Das8h7ErQYKBkdDMqWaI13LdU6ZETroKUKMMP2gFrtz6aveRrKOJidygRjJCKUqw0VA6pE8kpiaWYCA=s640-c-rw-v1-e365","description":"THESE GRILLED PORK CHOPS ARE SO EASY TO MAKE AND TASTE INCREDIBLE!","prepTime":17,"servings":5,"source":"https://www.yummly.com/recipe/Grilled-Pork-Chops-2191892","dateCreated":{"$date":"2019-06-23T01:52:03.642Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb4bc191272ec02e78d4"},"ingredients":["4 bone-in pork chops","2 cloves garlic","1 cup fresh basil","2 tablespoons lemon juice","2 tablespoons extra virgin olive oil","1 teaspoon coarse salt","1/2 teaspoon black pepper"],"directions":["With machine running, drop garlic through feed tube of food processor to mince. Stop, add fresh basil, and process until chopped. Add lemon juice, oil, salt, and pepper and process to make thin wet rub. Spread both sides of pork chops with basil mixture. Let stand 15 to 30 minutes.","Prepare a medium-hot fire in grill. Brush the grate clean and oil the grate. Grill chops, over direct heat, turning once, to medium rare doneness, 5 to 6 minutes per side, or until the internal temperature reaches 145 degrees Fahrenheit, followed by a 3-minute rest time."],"tags":["Main Dishes","Grilling","Low Sugar","Browning","Low Carb","Low Calorie"],"label":"Grilled Pork Chops with Basil-Garlic Rub","image":"https://lh3.googleusercontent.com/KQlVT3lrsGGQTcx9CXi_tHFLl0na9OSo_oGqRzF-iObzfR5IZvgHU051g0iwDPrWG23ZQKCSEggibdswiEOM=s640-c-rw-v1-e365","description":"Cut from the pork loin, pork chops can be found under a variety of names, including Porterhouse, Ribeye, New York, Sirloin and Blade pork chops.","prepTime":40,"servings":4,"source":"https://www.yummly.com/recipe/Grilled-Pork-Chops-with-Basil-Garlic-Rub-2261216","dateCreated":{"$date":"2019-06-23T01:52:11.753Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb54c191272ec02e78d5"},"ingredients":["3 tablespoons vegetable oil","3 tablespoons balsamic vinegar","2 tablespoons soy sauce","2 tablespoons black peppercorns","4 salmon fillet","2 tablespoons olive oil","4 scallions"],"directions":["Whisk together the vegetable oil, balsamic vinegar, soy sauce and crushed peppercorns. Pour the mixture over the salmon fillets, make sure they are completely coated and set aside to marinate for 30 minutes."," Remove the salmon from the marinade. Heat the olive oil in a large frying pan until smoking then cook the salmon, skin side down, for 2 minutes. Turn the fish over, pour on the marinade and cook for 2 more minutes, basting with the cooking juices, or until the fish is just cooked through.","Turn the fish once more then scatter over the spring onions, heat through briefly and serve immediately."],"tags":["Main Dishes","Low Sugar","Marinating","Low Carb"],"label":"Glazed Salmon Fillets","image":"https://lh3.googleusercontent.com/MT2v8B7-VSzcWSOLjkv0SPk_XznIdY0BRYmffINoQq-FuJfiHqyF2uLaJFe_wmkOs-LkZ7g8oMGazm5kv3db=s640-c-rw-v1-e365","description":"Glazed Salmon Fillets","prepTime":50,"servings":4,"source":"https://www.yummly.com/recipe/Glazed-Salmon-Fillets-2681166","dateCreated":{"$date":"2019-06-23T01:52:20.160Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb5cc191272ec02e78d6"},"ingredients":["1 pound skirt steak","pepper","salt","6 teaspoons minced garlic","1/4 cup chopped parsley","5 tablespoons unsalted butter","salt"],"directions":["Cut the steak into 3 or 4 parts. Pat the steaks dry then season both sides liberally with salt and pepper","In a heavy duty skillet large enough for the skirt steak, heat oil over medium-high heat until it’s very hot. Add the steak and sear both sides (brown both sides) for 2-3 minutes until medium rare or cook longer until your desired doneness. I cooked mine for about 4 minutes on each side. Place steaks to rest on a plate and cover with foil.","In a skillet melt the butter over low heat then add the garlic. Cook swirling or using a spatula to move the butter and garlic around until lightly golden. Don’t over cook, or the butter and garlic will burn","Pour the garlic butter into a bowl and salt to taste. Slice the steak against the grain. Garnish with parsley and then spoon or pour the garlic butter over the steak. Serve immediately. *See notes0."],"tags":["Main Dishes","Brazilian","Quick and Easy","Drying","Quick","Low Sugar","Low Sodium","Low Carb","Low Calorie"],"label":"Garlic Butter Brazilian Steak","image":"https://lh3.googleusercontent.com/PASBnYzNSjzmp5Nt2mJsomhClU_YU6G3znk9P15kdcZxAlEH-Ki0p2s-jf3d29pF8MS6nBZpEoIw3EJnPwNE2DQ=s640-c-rw-v1-e365","description":"Garlic Butter Brazilian Steak Recipe – most tender and juicy steak with a golden garlic butter sauce that’s out of this world good! So easy","prepTime":30,"servings":4,"source":"https://www.yummly.com/recipe/Garlic-Butter-Brazilian-Steak-9005465","dateCreated":{"$date":"2019-06-23T01:52:28.125Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb67c191272ec02e78d7"},"ingredients":["3 tablespoons canola oil","1 medium onion","1 red bell pepper","8 yukon gold potatoes","2 cups vegetable broth","30 ounces coconut milk","15 ounces diced fire roasted tomatoes","2 tablespoons red curry paste","4 cloves garlic","2 tablespoons minced ginger","1 head cauliflower","1 cup carrots","5 ounces baby spinach","1 lime","thai basil leaves","3 cups jasmine rice"],"directions":["Heat canola or coconut oil over medium-high heat in a large skillet or saute pan. Add the onion and cook 5-8 minutes or until beginning to soften.","Add the red bell pepper and potatoes and cook 2-3 minutes.","Add the vegetable broth, coconut milk, tomatoes, red curry paste, garlic and ginger. Bring to a boil.","Add the cauliflower florets. Reduce heat to medium-low and simmer 8-10 minutes.","Add the carrots. Cook another 5 minutes.","Add the baby spinach and stir until wilted.","Add lime juice.","Garnish with fresh Thai basil leaves.","Serve with cooked jasmine rice."],"tags":["Main Dishes","Thai","Curry","Sauteeing","Boiling"],"label":"Vegan Thai Red Curry with Cauliflower and Potatoes","image":"https://lh3.googleusercontent.com/fYpTyw_RYx9CTtRoZpWTvm4BJGiiuArHqBOYLgIexbAKBmFm6nrl_h3fFK-TnrLmBybqaSkdbXwSo1qb4nsacA=s640-c-rw-v1-e365","description":"Vegan Thai Red Curry with Cauliflower and Potatoes is spicy and delicious with a side of healthy!  It’s the perfect veggie-packed meal to warm you up on a chilly fall night you won’t feel guilty about!","prepTime":45,"servings":4,"source":"https://www.yummly.com/recipe/Vegan-Thai-Red-Curry-with-Cauliflower-and-Potatoes-2591658","dateCreated":{"$date":"2019-06-23T01:52:39.012Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb74c191272ec02e78d8"},"ingredients":["1 tablespoon vegetable oil","12 ounces andouille sausage","3 boneless, skinless chicken thighs","1 onion","1 red bell pepper","2 celery ribs","3 garlic cloves","2 1/2 teaspoons creole seasoning","3/4 teaspoon dried thyme","1/2 teaspoon salt","1 1/2 cups long grain rice","14 1/2 ounces diced tomatoes with juice","1 teaspoon Worcestershire sauce","2 cups chicken broth","2 bay leaves","1 teaspoon Tabasco Sauce","1 pound large shrimp","1 tablespoon fresh parsley"],"directions":["Turn Instant Pot to Saute and add oil to inner pot. Add sausage and cook until browned, about 5 minutes. Remove with a slotted spoon and set aside.","Add chicken and sprinkle with 1/2 teaspoon Creole seasoning.  Cook until browned, about 5 minutes. Remove with a slotted spoon and set aside with sausage.","Add onion, celery, and red pepper and cook until onion is soft, about 4 minutes.","Add garlic and cook 1 more minute.","Stir in 2 teaspoons of Creole seasoning, thyme, salt, tomatoes, rice, Worcestershire sauce, broth, bay leaves, and Tabasco sauce. Stir in sausage and chicken.","Turn Instant Pot to Pressure Cook/High (or Manual) for 7 minutes. Be sure valve is in Sealing position.","Do a quick release and open Instant Pot. Do not open until the pin drops. Stir in shrimp, parsley, and green onions. Cover Instant Pot and turn it off. Let the residual heat cook the shrimp for about 8 to 10 minutes."],"tags":["Main Dishes","Caju \u0026 Creole","Jambalaya","Sauteeing","Low Sugar","Browning"],"label":"Instant Pot Jambalaya","image":"https://lh3.googleusercontent.com/lotwTmJ25YYzdf_zPQdkK-ywubtsFO50ZQZe6vz-pFp-wCwUB89IQ7QTMWJ4uQnZlLA3ND-yrduraBTV1Va4tQ=s640-c-rw-v1-e365","description":"Instant Pot Jambalaya with chicken, andouille sausage, shrimp and lots of spice makes a flavorful New Orleans-style meal. Jambalaya is super easy to cook in a pressure cooker and it doesn’t take much time at all. The Instant Pot does a great job of melding all the flavors together in a short amount of time.","prepTime":60,"servings":4,"source":"https://www.yummly.com/recipe/Instant-Pot-Jambalaya-2581822","dateCreated":{"$date":"2019-06-23T01:52:52.844Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb80c191272ec02e78d9"},"ingredients":["2 bananas ","2 tablespoons unsweetened almond milk","1/2 teaspoon vanilla extract","1 pinch sea salt"],"directions":["Add banana, almond milk, vanilla extract or seeds from vanilla bean, and sea salt to a food processor or high-powered blender.","Puree until mixture has a soft-serve consistency. Use a spatula as needed to scrape the sides of the processor bowl or blender.","Enjoy as is or transfer to a container and freeze for 30 to 60 minutes for a firmer texture."],"tags":["Blending"],"label":"4-Ingredient Banana Nice Cream","image":"https://lh3.googleusercontent.com/FJh4_cIS0ZOqfF5Y7vvnR0NBkyYrdOqLMY8xrVLNUoweuwJ3E-14Elf-9WxRNHslWaDH2z1TsrqN0qjFqxWHgQ=s640-c-rw-v1-e365","description":"This 4-Ingredient Banana Nice Cream is just as delicious as it is diet-approved. With a little assistance from some ripened, frozen bananas, you’ll be biting into a spoonful of ice cream in no time.","prepTime":40,"servings":2,"source":"https://www.yummly.com/recipe/4-Ingredient-Banana-Nice-Cream-2477155","dateCreated":{"$date":"2019-06-23T01:53:04.176Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb88c191272ec02e78da"},"ingredients":["1 1/3 cups mashed bananas","2 1/2 tablespoons lemon juice","1 1/2 cups milk","3 cups flour","1/2 tablespoon baking soda","1/4 teaspoon salt","2/3 cup butter","1 cup white sugar","1/2 cup brown sugar","3 large eggs","1 teaspoon vanilla","8 ounces cream cheese","1/3 cup butter","3 1/2 cups powdered sugar","1 teaspoon lemon juice","1 1/2 teaspoons lemon zest"],"directions":["Preheat oven to 350°. Grease and flour a 9 x 13 pan.","Place 1 1/2 tablespoons lemon juice in a measuring cup. Top to 1 1/2 cups with milk. Set aside.","Mix together mashed banana with 1 tablespoon lemon juice, set aside.","Beat together butter, brown and white sugar until combined. Add in eggs one at a time and vanilla. Mix on high until light and fluffy (almost the texture of frosting).","Combine flour, baking soda and salt in a medium bowl. Alternate adding flour mixture and milk to egg mixture stirring just until combined. (Do not overmix). Fold in bananas. Pour into prepared pan.","Put into the oven and reduce heat to 300 degrees. Bake 60 – 70 minutes (see note below) or just until toothpick inserted in center comes out clean (do not over bake).","Remove from oven and place in the freezer for 45 minutes to make the cake extra moist. Cool completely before frosting.","Cream together butter \u0026 cream cheese until fluffy. Add in lemon zest and juice.","Add powdered sugar a little at a time until you reach desired consistency. Spread over cooled cake."],"tags":["Desserts","Cake","Frosting","Browning","Baking"],"label":"The BEST Banana Cake","image":"https://lh3.googleusercontent.com/6ZMzoG8CZkk6w82rUackzSqY-qV_oFVlB2k3YUkhM-xj0lzg9nLj_SoDZCsoIkxhtxDUv9w7k-JVwecJbp9IVw=s640-c-rw-v1-e365","description":"This is, hands down, the BEST banana cake I’ve ever had.  It’s soft, moist and rich all at the same time!  Once cooled this cake is topped with a totally irresistible lemon cream cheese frosting for a perfect dessert your family will love.","prepTime":95,"servings":15,"source":"https://www.yummly.com/recipe/The-BEST-Banana-Cake-2209402","dateCreated":{"$date":"2019-06-23T01:53:12.389Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb8fc191272ec02e78db"},"ingredients":["5 boneless, skinless chicken breasts","1 packet seasoning","16 ounces sour cream","2 cups shredded cheddar cheese","5 slices bacon"],"directions":["Crock Pot Cheesy Bacon Ranch Chicken is one of the easiest and most delicious chicken recipes ever! Wondering what to make for dinner tonight? This is it!","Shred the cooked chicken and stir in sour cream, cheese, and bacon. Serve on a bun, or with potatoes or rice."],"tags":["Main Dishes","Easy","Slow Cooking"],"label":"Crock Pot Cheesy Bacon Ranch Chicken","image":"https://lh3.googleusercontent.com/_xryKxkL87ZAie8bIU_GXndtboLFPJJL3cAuVG4I0iGhK2iczm48Aae3GeAKyaTT3eE5S3w0zBtHPvAZG9u-=s640-c-rw-v1-e365","description":"Crock Pot Cheesy Bacon Ranch Chicken is one of the easiest and most delicious chicken recipes ever! Wondering what to make for dinner tonight? This is it!","prepTime":40,"servings":6,"source":"https://www.yummly.com/recipe/Crock-Pot-Cheesy-Bacon-Ranch-Chicken-2369476","dateCreated":{"$date":"2019-06-23T01:53:19.886Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edb9ec191272ec02e78dc"},"ingredients":["2 pounds beef stew meat","7/8 ounce brown gravy mix","1 ounce au jus mix","1 cup water","12 ounces wide egg noodles"],"directions":["In the crock of a 4 to 6-quart slow cooker, stir together the meat, gravy mix, au jus mix, and water.  Cover and cook on low for 6 to 8 hours.","Cook the noodles according to the package instructions.  Serve the noodles topped with the beef."],"tags":["Main Dishes","Low Sugar","Slow Cooking","Low Fat","Low Calorie"],"label":"Slow Cooker Beef and Noodles","image":"https://lh3.googleusercontent.com/7hS9sy1_AASPAl6czHPfO4j15JCDqh_q6uQaahCb2szvfyRyRpg07cM9irUJGTv8Q8uzT6OzUDufJr7wRGhDzA=s640-c-rw-v1-e365","description":"This Slow Cooker Beef and Noodles is just that.  It’s amazingly simple, but ridiculously delicious","prepTime":35,"servings":4,"source":"https://www.yummly.com/recipe/Slow-Cooker-Beef-and-Noodles-2498260","dateCreated":{"$date":"2019-06-23T01:53:34.158Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edba9c191272ec02e78dd"},"ingredients":["1 pound jumbo shrimp","2 1/2 tablespoons all purpose flour","2 teaspoons paprika","1 1/2 teaspoons sea salt","1 teaspoon black pepper","18 large garlic cloves","2 tablespoons extra-virgin olive oil ","1 stick unsalted butter","chopped parsley"],"directions":["Place the flour, paprika, salt, and black pepper in a large resealable bag.","Add the shrimp to the bag and coat the shrimp with the flour mixture. Make sure all the shrimp is coated evenly. Set the shrimp aside.","Melt the butter and one tablespoon of olive oil on medium heat in a large pan. Once the butter has melted, add the chopped garlic to the melted butter \u0026 oil, and cook for 2 to 3 minutes until you see the garlic has turned light brown. TAKE CARE TO NOT BURN THE GARLIC!","Remove the garlic sauce from the pan and set aside","Add the second tablespoon of olive oil to the pan. Once heated, add your shrimp to the pan.","Cook the shrimp over medium high heat for 2 to 3 minutes on each side. You may need to cook the shrimp in batches to avoid overcrowding the pan.","Once you have cooked the last batch of shrimp, add all the shrimp back to the pan and pour over the garlic sauce. Stir to combine and garnish with parsley.","Serve Hawaiian Style with sticky white rice and macaroni salad!"],"tags":["Main Dishes","Quick","Low Sugar","Low Carb","Low Calorie"],"label":"Hawaiian Garlic Shrimp","image":"https://lh3.googleusercontent.com/a3o25-8_nKEn51MQeF35PmvAaefXAiWtTozR3hU9ysMRgFIBt6nvMmOd7O_2fELfPm1J590gxU1wkZpldjK0Vc4=s640-c-rw-v1-e365","description":"Juicy prawns cooked in a garlicky buttery sauce, this Hawaiian Garlic Shrimp is just like the shrimp trucks you'd find in Hawaii.","prepTime":20,"servings":5,"source":"https://www.yummly.com/recipe/Hawaiian-Garlic-Shrimp-2675954","dateCreated":{"$date":"2019-06-23T01:53:45.423Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edbb1c191272ec02e78de"},"ingredients":["7 ounces smoked sausage","1/2 cup chicken broth","1/2 teaspoon oregano","1/4 teaspoon red pepper flakes","3 teaspoons garlic","2/3 cup onion","1 red bell pepper","1 green bell pepper, sliced","1 yellow bell pepper"],"directions":["Spray large skillet with cooking spray","Add sausage and stir frequently, until no longer pink 5-6 minutes","Add bell peppers, onion, broth, garlic, pepper flakes, and oregano. Sauté until liquid is gone and vegetables soften. If your skillet seems full don’t worry so was mine and it cooked fine! Usually about 5 minutes!","Reduce heat and simmer covered for another 5 minutes, stirring occasionally! And enjoy this mostly veggie dish!"],"tags":["Easy","Low Sugar","Sauteeing","Low Carb","Low Calorie"],"label":"Smoked Sausage And Bell Peppers ","image":"https://lh3.googleusercontent.com/nu2nbd2jPVj3SaeB_Jhb485iEQxmGzA-3w2BH8nz0V-MuFRwfBSTF-oN5c5Eq_ZylsqgoeHJKjchUlDHDYnGlA=s640-c-rw-v1-e365","description":"Smoked Sausage And Bell Peppers (weight Watchers Recipe)","prepTime":35,"servings":4,"source":"https://www.yummly.com/recipe/Smoked-Sausage-And-Bell-Peppers-_weight-Watchers-Recipe_-1601681","dateCreated":{"$date":"2019-06-23T01:53:53.472Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edbedc191272ec02e78df"},"ingredients":["4 boneless skinless chicken thighs","vegetable oil","2 large eggs","2 tablespoons heavy whipping cream","2/3 cup blanched almond flour","2/3 cup grated parmesan cheese","1 teaspoon salt","1/2 teaspoon black pepper","1/2 teaspoon paprika","1/2 teaspoon cayenne"],"directions":["Add 1 to 2 inches of vegetable oil to a pot over medium-high heat. Heat the oil to 350 F, and frequently monitor to maintain the temperature by adjusting the flame during frying.","In a bowl, add eggs and heavy cream, beating until well-mixed. In another bowl, stir together all breading ingredients until well-mixed. Set aside.","Cut each chicken thigh into 3 evenly sized pieces. If moist, pat them dry with paper towels.","Coat each piece first in the breading, then in the egg wash, and then in the breading again, coating all sides. Shake off excess and carefully lower into the hot oil. Fry until deep brown and cooked through, about 5 minutes, and drain on paper towels.","Repeat with the other chicken pieces. You may want to work in batches to avoid overcrowding in the pot -- I usually have 6 chicken pieces frying simultaneously in a 8-inch wide pot.","Serve immediately while hot and crispy."],"tags":["Main Dishes","Quick","Fried Chicken","Frying","Low Sugar","Low Carb","Drying"],"label":"Best Keto Fried Chicken","image":"https://lh3.googleusercontent.com/nqwn7T2LUublVn3mxl5aGdc5B-gG2nu47gweCyZl87kW9VU6KJXl1SNbusB9Ji38GKvr3K_jOzuFdX-4FkslvA=s640-c-rw-v1-e365","description":"Healthy keto fried chicken that’s crispy and crunchy, made with boneless thigh meat “breaded” in almond flour and parmesan cheese. Low carb and gluten free.","prepTime":25,"servings":4,"source":"https://www.yummly.com/recipe/Best-Keto-Fried-Chicken-2540700","dateCreated":{"$date":"2019-06-23T01:54:53.066Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edbf9c191272ec02e78e0"},"ingredients":["8 ounces full fat cream cheese","2 eggs","ground black pepper","garlic powder","1/4 cup grated parmesan cheese","1/2 cup marinara sauce","1 pinch cayenne pepper","1/2 teaspoon oregano","1 cup shredded mozzarella cheese","pepperoni","garlic powder"],"directions":["Preheat oven to 350.","Butter a 9×13 baking dish (or line the dish with parchment paper)","Blend cream cheese and eggs and season with pepper \u0026 garlic powder","Add parmesan cheese and stir until combined","Pour into buttered baking dish (or over parchment paper)","Bake for 17 minutes or until golden brown","Let crust cool for 10 minutes before adding toppings","After crust is cooked, raise oven to 400 degrees","Mix together marinara sauce, garlic powder, cayenne pepper \u0026 oregano","Top crust with marinara and spread evenly","Top with mozzarella cheese","Add toppings","Bake for 8 minutes or until cheese is bubbly"],"tags":["Main Dishes","Easy","Pizza","Low Sugar","Browning","Low Carb","Baking"],"label":"No Carb Pizza","image":"https://lh4.ggpht.com/-UsFDNpTKCuAU1Fsy2bnIdpgrNhX9NChNuqb-NdAunDSfbyhz3ZaK_8mhl54U6PGoj8-tAYHH4BbLU8Ds6E8dA=s640-c-rw-v1-e365","description":"This almost no carb pizza recipe is perfect for diet plans such as Atkins, low carb or ketogenic diets \u0026 anyone looking to reduce their carb intake.","prepTime":45,"servings":4,"source":"https://www.yummly.com/recipe/No-Carb-Pizza-980189","dateCreated":{"$date":"2019-06-23T01:55:05.950Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc3ac191272ec02e78e1"},"ingredients":["8 ounces full fat cream cheese","2 eggs","ground black pepper","garlic powder","1/4 cup grated parmesan cheese","1/2 cup marinara sauce","1 pinch cayenne pepper","1/2 teaspoon oregano","1 cup shredded mozzarella cheese","pepperoni","garlic powder"],"directions":["Preheat oven to 350.","Butter a 9×13 baking dish (or line the dish with parchment paper)","Blend cream cheese and eggs and season with pepper \u0026 garlic powder","Add parmesan cheese and stir until combined","Pour into buttered baking dish (or over parchment paper)","Bake for 17 minutes or until golden brown","Let crust cool for 10 minutes before adding toppings","After crust is cooked, raise oven to 400 degrees","Mix together marinara sauce, garlic powder, cayenne pepper \u0026 oregano","Top crust with marinara and spread evenly","Top with mozzarella cheese","Add toppings","Bake for 8 minutes or until cheese is bubbly"],"tags":["Main Dishes","Easy","Pizza","Low Sugar","Browning","Low Carb","Baking"],"label":"No Carb Pizza","image":"https://lh4.ggpht.com/-UsFDNpTKCuAU1Fsy2bnIdpgrNhX9NChNuqb-NdAunDSfbyhz3ZaK_8mhl54U6PGoj8-tAYHH4BbLU8Ds6E8dA=s640-c-rw-v1-e365","description":"This almost no carb pizza recipe is perfect for diet plans such as Atkins, low carb or ketogenic diets \u0026 anyone looking to reduce their carb intake.","prepTime":45,"servings":4,"source":"https://www.yummly.com/recipe/No-Carb-Pizza-980189","dateCreated":{"$date":"2019-06-23T01:56:10.275Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc41c191272ec02e78e2"},"ingredients":["1 1/2 pounds chicken breast tenders","2 bell peppers","1 yellow onion","2 tablespoons avocado oil","2 1/2 tablespoons fajita seasoning","1 teaspoon kosher salt","1 lime","chopped fresh cilantro"],"directions":["Begin bv making the Homemade Taco \u0026 Fajita Seasoning.  I use this so often, I usually have a good amount on hand already!","Slice your peppers and onions (and chicken if not using tenders.)","Combine the chicken, peppers, onions, seasoning, oil, and lime juice in a large bowl.  Toss well to coat.","Spread everything onto a large baking sheet lined with a wire rack.","Spread everything onto a large baking sheet lined with a wire rack.","Preheat oven to 400 degrees.  Prepare a large baking sheet by placing a metal cooling rack on the tray and spraying with avocado or coconut oil.","Combine chicken, peppers, onion, oil, seasoning, and lime juice together in a large bowl.  Toss well.","Place mixture on the rack in an even layer.  Bake for 15-18 minutes, until chicken is cooked through.  Turn the oven broiler on and place under the broiler for about 2 minutes.","Sprinkle with fresh cilantro, if desired."],"tags":["Quick","Fajitas","Broiling","Baking"],"label":"Easy Sheet Pan Chicken Fajitas ","image":"https://lh3.googleusercontent.com/5Utze3UoD0zVxgPJEX6ykOcTEzzBnd_EJg6geQNMhL3xWfTip8dPK_m_efye1zjq6SpmM_lUNFw_Rloor3Fd1uI=s640-c-rw-v1-e365","description":"Easy Sheet Pan Chicken Fajitas (Whole30 Paleo Keto) – ready in under 30 minutes, these Sheet Pan Chicken Fajitas are a fast and fuss-free way to enjoy restaurant style fajitas at home!","prepTime":25,"servings":6,"source":"https://www.yummly.com/recipe/Easy-Sheet-Pan-Chicken-Fajitas-_Whole30-Paleo-Keto_-2715542","dateCreated":{"$date":"2019-06-23T01:56:17.675Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc49c191272ec02e78e3"},"ingredients":["1 teaspoon extra virgin olive oil","2 garlic cloves","1 1/2 cups marinara sauce","3 tablespoons grated parmesan cheese","freshly ground black pepper","4 chicken cutlets","1/2 teaspoon kosher salt","1/2 teaspoon dried oregano","4 ounces fresh mozzarella cheese","chopped basil"],"directions":["Using the sauté function (on low, if possible), heat the oil in the pressure cooker pot. Stir in the garlic and cook until just turning golden, about 2 minutes. Stir in the marinara sauce, 2 tablespoons of the Parmesan, and 1/4 teaspoon pepper.","Increase the sauté heat to medium.","Season the chicken with the salt, oregano, and pepper to taste. Nestle the cutlets into the sauce, overlapping as little as possible, then spoon the sauce over to cover the chicken.","Lock the lid into place and cook on low pressure for 3 minutes. Manually release the pressure.","Sprinkle the mozzarella and the remaining 1 tablespoon Parmesan evenly over the chicken. Cover the pot with the lid (but don’t lock it on) and let it sit for 4 to 5 minutes to melt the cheese.","Serve as is or, for deeper flavors and a little bit of crispiness, broil the cheese until golden and bubbling: Heat the broiler with a rack 4 inches from the heat source. Scoop the chicken and sauce into a greased small rimmed baking sheet, trying to keep the cheese on top. Broil until the cheese has browned, 2 to 3 minutes. Sprinkle with basil, if desired."],"tags":["Main Dishes","Quick","Sauteeing","Pressure Cooking"],"label":"Instant Pot Chicken Parmesan","image":"https://lh3.googleusercontent.com/oYzOw9O7LIMnCBN2zB5qBNHrJBA7b_AGGAB7IN_qFfLP55q9-cUQ87h3gN5TBrUDmf01W8rp5HbUTX8oxN2XL4U=s640-c-rw-v1-e365","description":"This quick and easy Chicken Parmesan is the answer to your weeknight dreams!! And since it’s made in the Instant Pot, it’s ready in minutes!","prepTime":18,"servings":4,"source":"https://www.yummly.com/recipe/Instant-Pot-Chicken-Parmesan-2635589","dateCreated":{"$date":"2019-06-23T01:56:25.642Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc52c191272ec02e78e4"},"ingredients":["2 cups pasta","1 tablespoon extra virgin olive oil","1 pound ground beef","1/2 teaspoon pepper","3 garlic cloves","1 teaspoon crushed red chili flakes","1 tablespoon worcestershire sauce","2 tablespoons tomato paste","1 onion","1/2 cup chopped parsley","salt","2 cups shredded mozzarella"],"directions":["This beefy and cheesy skillet dinner is so good, it’s worthy of company!","Meanwhile in a large skillet over high heat add 1 tablespoon olive oil and brown beef while breaking up with a wooden spoon, about 2 minutes. Reduce to medium heat. Season with 1 teaspoon salt and ½ teaspoon black pepper. Stir in garlic, onions, chili flakes, Worcestershire sauce, tomato paste, parsley, and ½ cup pasta (or plain) water. Simmer until meat is tender, about 8 to 10 minutes.","Toss in pasta and 1 cup mozzarella. Top with remaining cheese and cover with lid. Garish with additional parsley."],"tags":["Main Dishes","Quick","Low Sugar"],"label":"Cheesy Ground Beef Pasta Skillet","image":"https://lh3.googleusercontent.com/SaeoZ1lMoDPvkw5KcMRZlTXZ6VG0oYnoSGlSmcfNjssah0G94ieWr77L5NlXDUT7VRoA3y46hXsgtelxRE9gy_Y=s640-c-rw-v1-e365","description":"This beefy and cheesy skillet dinner is so good, it’s worthy of company!","prepTime":25,"servings":4,"source":"https://www.yummly.com/recipe/Cheesy-Ground-Beef-Pasta-Skillet-2423229","dateCreated":{"$date":"2019-06-23T01:56:34.925Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc5ac191272ec02e78e5"},"ingredients":["4 pounds chicken","red onion","garlic cloves","15 habanero chiles","scallions","3 inches ginger","chopped fresh thyme","ground cinnamon","whole allspice","kosher salt","adobo seasoning","seasoning"],"directions":["Pierce chicken all over with tip of a small knife; transfer to a large bowl. Purée remaining ingredients and 1/4 cup water in a blender until smooth. Reserve 1 cup for dipping sauce, if desired. Pour remaining marinade over chicken; massage into chicken. (To protect your hands from the chiles' heat, wear latex gloves.) Cover; chill for at least 1 day and up to 2 days.","Let chicken sit at room temperature for 1 hour before cooking. Build a medium-low fire in a charcoal grill, or heat a gas grill to medium. Place chicken on grill, skin side up. Cook covered, turning often, until skin is crisp and lightly charred and an instant-read thermometer inserted into the thickest parts of chicken registers 160° (breasts) or 165° (thighs), 30–45 minutes. Transfer to a platter and tent loosely with foil; let stand for 10 minutes. Serve with reserved dipping sauce, if desired."],"tags":["Main Dishes","Jamaican","Jerk","Grilling","Barbecue"],"label":"Jerk Chicken","image":"https://lh4.ggpht.com/6fExnBNcqT00z7mIjc5Rr7y3NcPu-GJq2UTphb1nrLtJ7yABWi8aRQr5YUse6gRVwyGFKvloa9TJ4l5fPAmeiQ=s640-c-rw-v1-e365","description":"Some like it hot. And those that do will absolutely love this jerk chicken recipe, which calls for heaps of Scotch bonnet (or habanero) peppers.","prepTime":65,"servings":4,"source":"https://www.yummly.com/recipe/Baked-Crispy-Chicken-Legs-2542326","dateCreated":{"$date":"2019-06-23T01:56:42.667Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc64c191272ec02e78e6"},"ingredients":["16 ounces elbow pasta","2/3 cup raw cashews ","1 1/3 cups filtered water","1/3 cup roasted red peppers","2 tablespoons nutritional yeast","2 tablespoons arrowroot powder","2 tablespoons apple cider vinegar","2 teaspoons smoked paprika","1 teaspoon sea salt","freshly ground black pepper","1 pinch cayenne pepper","1 dash hot sauce"],"directions":["Bring a large pot of salted water to a boil. Add the pasta and cook until al dente and drain, reserving 1 cup of the pasta water. Return the pasta to the pan.","Meanwhile, make the Smoky Cashew Cheddar Cheese by adding the soaked and drained cashews, filtered water, roasted red peppers, nutritional yeast, arrowroot, apple cider vinegar, smoked paprika, sea salt, black pepper, cayenne (if using), and hot sauce (if using) to a high-speed blender. Blend on high for 2 to 3 minutes or until completely smooth, stopping to scrape down the sides as needed.","Once the pasta is ready, pour the Smoky Cashew Cheddar Cheese mixture into a medium saucepan. Heat over medium for 5 minutes or until very thick and just shy of stretchy, whisking constantly. Once thickened, immediately turn off the heat to avoid overheating. Arrowroot loses its thickening power if overheated, so be attentive to it.","Spoon the cheese over the pasta and toss to coat, adding pasta water, a few tablespoons at a time, as needed to thin the sauce. Season with more sea salt, smoked paprika, and black pepper, to taste. I usually add another 1/2 teaspoon sea salt, another dash or two of smoked paprika, and a few grinds of black pepper; however, seasoning will vary depending on the amount of pasta you used and how salty your pasta water was, so adjust according to your tastes."],"tags":["Main Dishes","Quick","Low Sugar","Boiling"],"label":"Smoky Vegan Macaroni and Cheese","image":"https://lh3.googleusercontent.com/vH0jmIpKAf_VIVBgikaaEXMpSSUFjZdxhdqWf7Ehp0iL97j90jrZ6SAO8zQF6EYvAyBWk05ilgu2rA0aiCc7CH4=s640-c-rw-v1-e365","description":"This smoky vegan macaroni and cheese is the ultimate comfort food. It’s rich, ultra cheesy, made with whole plant-powered ingredients, and it comes together in a speedy 30 minutes flat.","prepTime":30,"servings":5,"source":"https://www.yummly.com/recipe/Smoky-Vegan-Macaroni-and-Cheese-2265218","dateCreated":{"$date":"2019-06-23T01:56:52.902Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc70c191272ec02e78e7"},"ingredients":["1 box firm tofu","1/2 cup cooking oil ","1 clove garlic","1 teaspoon minced ginger","1 scallion (white,minced)","1 scallion (green part,minced for garnishing)","2 tablespoons ketchup","6 tablespoons water","1/2 tablespoon corn starch","1/2 tablespoon sugar","1/2 tablespoon light soy sauce","1/2 tablespoon vinegar"],"directions":["Firstly, mix all the ingredients for sweet and sour sauce together.","Cut firm tofu into small cubes. Place around 1/2 cup of oil in a small pan. Place the tofu cubes in. Start the fire and fry them ( by two batches if necessary). During the process, stir them from time to time so they can be heated evenly. Transfer out when they are all golden brown.","Remove extra oil and leave only around 1 tablespoon in the pan, fry garlic, scallion white and ginger over slow fire until aromatic. Pour the sweet and sour sauce mix in, heat to boil.","Return the tofu cubes and continue heating over slow fire until the sauce is well-thickened and sticky to the tofu cubes.","Garlic some spring onions and serve with steamed rice."],"tags":["Main Dishes","Low Sugar","Frying","Low Sodium","Low Carb","Low Calorie","Boiling"],"label":"Sweet and Sour Tofu","image":"https://lh3.googleusercontent.com/u4TfwujhV6b8F4p7abtqc5-EZa8b24wLQ7TZ6FbPMpfOhZPdekZuxIZZ7aDNK3IXPBOeOduOU8HFV3Vcc2Guml4=s640-c-rw-v1-e365","description":"This lovely sweet and sour crispy tofu with veggies is paying all the work off. Inside the delicious sauce, the amazing crispy shell with a faint aroma of bean curd is extremely appealing.","prepTime":45,"servings":4,"source":"https://www.yummly.com/recipe/Sweet-and-Sour-Tofu-2674199","dateCreated":{"$date":"2019-06-23T01:57:04.339Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc78c191272ec02e78e8"},"ingredients":["1 pound white fish","1 teaspoon cumin","1 teaspoon onion powder","1 teaspoon garlic powder","1 tablespoon coconut oil","1/2 cup greek yogurt","1 chipotle pepper in adobo sauce (from 7 oz can, more if you like it really spicy, less if you're a wuss)","1 tablespoon lime juice","1/2 teaspoon coarse sea salt","cilantro","radishes","lettuce"],"directions":["Mix all ingredients in blender. Blend until smooth.","Chill in fridge until ready to eat with tacos!","In a small bowl, mix together the cumin, onion and garlic powder. Sprinkle both sides of each fish fillet evenly with the seasoning.","Heat coconut oil in pan over medium-high heat until HOT.","Lay fish fillets in pan and cook for 5 minutes without turning.","After 5 minutes, flip fish and cook on the other side for about 2 minutes, or until fish begins to flake.","Remove pan from heat and flake the fish with a fork. Serve fish on warm corn tortillas, top with lettuce, cilantro, radishes and chipotle lime crema and enjoy!"],"tags":["Main Dishes","Quick","Tacos","Low Sugar","Low Sodium","Low Carb","Low Calorie"],"label":"Fish Tacos with Chipotle Lime Crema","image":"https://lh3.googleusercontent.com/AJyEyV78oe8Lv53YERIsflBqwW1O3fssU_FjLQMDJalfIRMKXlZgKvaeyDXe0DP45p0MwmDTzXJnDLjnunRDtwM=s640-c-rw-v1-e365","description":"MADE WITH A BRIGHT AND CREAMY CHIPOTLE LIME CREMA MADE WITH GREEK YOGURT AND LIME JUICE, THESE FISH TACOS TAKE ONLY 15 MINUTES TO MAKE AND ARE GLUTEN FREE! ","prepTime":15,"servings":4,"source":"https://www.yummly.com/recipe/Fish-Tacos-with-Chipotle-Lime-Crema-1887197","dateCreated":{"$date":"2019-06-23T01:57:12.057Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc7ec191272ec02e78e9"},"ingredients":["8 3/4 ounces italian sausage","1/2 small onion","4 cloves garlic","1/3 cup dry white wine","14 fluidounces diced tomatoes","1 cup whipping cream","1 pound potato gnocchi","1/2 cup grated parmesan cheese","1 handful fresh basil","salt","salt"],"directions":["Prep your sausage and onion. ","Sauté the sausage pieces and onion in a skillet on on medium-high heat for 7-10 minutes, or until the sausage and onions are lightly browned.","Add the garlic to the pan and sauté for 30 seconds, or until fragrant.","Add the wine and let it cook for about a minute.","Stir in the diced tomatoes, cream, and gnocchi. Once the sauce starts to bubble again, cover the pan and reduce the heat to medium. Cook for 5 minutes.","Uncover the pan, give it a good stir, and let it cook for another few minutes, or until the gnocchi has cooked through and is nice and soft and the sauce has thickened to your liking.","Stir in the parmesan cheese, basil, and salt \u0026 pepper, to taste. Serve immediately."],"tags":["Main Dishes","Quick","Low Sugar","Sauteeing","Low Carb","Browning"],"label":"One Pan Creamy Gnocchi With Sausage","image":"https://lh3.googleusercontent.com/encXuAO-rqaWpobrMJ0wx-4mfs7eol48wQtecQpQmIEBNDYeQTWynL7Hd9jALRzkOABAbOefTMMxtxL1tMf6yMQ=s640-c-rw-v1-e365","description":"This one pan creamy gnocchi with sausage recipe is an easy, quick, and incredibly delicious comfort food meal. Ready in 30 minutes!","prepTime":30,"servings":4,"source":"https://www.yummly.com/recipe/One-Pan-Creamy-Gnocchi-With-Sausage-2427590","dateCreated":{"$date":"2019-06-23T01:57:18.923Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc8ac191272ec02e78ea"},"ingredients":["1 pound medium shrimp (peeled and deveined)","1 tablespoon cornstarch","2 1/2 tablespoons canola oil (divided)","1/4 cup green onions (diagonally cut)","2 teaspoons peeled fresh ginger (minced)","3 garlic cloves (thinly sliced)","2 cups broccoli florets","1/4 cup reduced sodium soy sauce","2 tablespoons rice vinegar","1 teaspoon honey","1/8 teaspoon crushed red pepper"],"directions":["Blot shrimp with a paper towel to dry and place in a medium bowl with cornstarch. Toss to coat.","Heat a large wok or skillet over high heat. Add 1 tablespoon oil and shrimp to pan; stir-fry about 4 minutes, or until golden brown. Do not over cook.","Remove shrimp from pan. Add 1 1/2 teaspoons oil and stir-fry green onions, ginger, and garlic for 45 seconds. Remove from pan and add to the shrimp.","Add the remaining 1 tablespoon oil to pan and stir-fry broccoli for 1 1/2 minutes. Stir in shrimp and onion mixture to pan. Pour in soy sauce, rice vinegar, honey, and red pepper flakes and bring to a boil. Cook just 1 minute or until broccoli is crisp-tender.","Serve immediately over rice."],"tags":["Main Dishes","Chinese","Quick","Stir Fry","Frying","Asian","Low Sugar","Low Carb","Low Calorie","Drying","Browning"],"label":"Chinese Shrimp and Broccoli Stir Fry","image":"https://lh3.googleusercontent.com/Mwk7wBWMM9wf1cNA1ZBagFjF78okmxXvfisoqsb1eE9kpej6_iYigVN1Gwpvd40Szt6uEr47s3FG-p4CtlcMM9Y=s640-c-rw-v1-e365","description":"Forget takeout when you can have this quick and easy Chinese shrimp and broccoli stir fry on the table with ease!","prepTime":20,"servings":4,"source":"https://www.yummly.com/recipe/Chinese-Shrimp-and-Broccoli-Stir-Fry-2635076","dateCreated":{"$date":"2019-06-23T01:57:30.913Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc94c191272ec02e78eb"},"ingredients":["1 1/4 ounces garlic","1 1/4 ounces ginger","1 head cauliflower","1 tablespoon vegetable oil","1/2 tablespoon lemon juice","1/2 teaspoon salt","1 teaspoon Garam Masala","28 ounces stewed tomatoes (whole)","2 tablespoons coconut oil","4 pods green cardamom","1 pod black cardamom","1 cinnamon stick","1 teaspoon fennel seeds","4 cloves","2 chili peppers (fresh, optional)","2 5/16 ounces raw cashew nuts (65 grams, or about 1/2 cup)","2 tablespoons nutritional yeast","1 teaspoon fenugreek leaves (kasuri methi)","1/2 teaspoon Garam Masala","1/2 teaspoon salt (to taste)"],"directions":["Preheat the oven to 400 degrees F (200 C).","Peel and grate the ginger and garlic together.","Wash the cauliflower and separate the florets into 2-inch chunks.","In a small bowl, stir together 1 tablespoon of vegetable oil, 1/2 tablespoon of lemon juice, 1/2 teaspoon of salt, 1 teaspoon of garam masala and 1/2 of the garlic ginger mixture. Pour this over the cauliflower and toss well to coat evenly.","Spread the cauliflower out onto a baking sheet and then roast in the oven until tender and golden brown (about 20-25 minutes).","Meanwhile, put the canned tomatoes in a blender and puree.","In a heavy bottomed pot, add the coconut oil, green and black cardamom, cinnamon stick, fennel seeds, cloves and chili peppers. Fry the spices until fragrant (1-2 minutes).","Add the remaining garlic and ginger mixture to the pot and fry until the garlic starts to brown and the mixture is very fragrant (2-3 minutes).","Add the pureed tomatoes and simmer over low heat until the tomatoes are thick and paste like (about 45 minutes). Once the mixture starts sputtering, you'll want to stir it constantly to speed up evaporation and to control the sputtering.","In the blender, puree the cashew nuts and nutritional yeast with 2 1/4 cups of water until smooth. When the tomatoes are done caramelizing, add the mixture to the pot and stir to combine.","Add the roasted cauliflower, fenugreek leaves, and 1/2 teaspoon of garam masala to the pot. Season with salt to to taste and simmer together until the flavors meld together (about 10 minutes)."],"tags":["Main Dishes","Indian","Roasting","Asian","Frying"],"label":"Vegan Butter Chicken","image":"https://lh3.googleusercontent.com/YlP1RkWryNvw-XmM8fiBNZ1Dg5J2Zsz2XvqpRfeyVDhwxHT4NwLVCcpunz18NJeQjGHYhT0yhd51PpDgX9vFoXw=s640-c-rw-v1-e365","description":"Butter Chicken is an Indian classic, and this vegan twist is similar to tomato and cauliflower curry. ","prepTime":85,"servings":4,"source":"https://www.yummly.com/recipe/Vegan-Butter-Chicken-1539807","dateCreated":{"$date":"2019-06-23T01:57:40.990Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edc9cc191272ec02e78ec"},"ingredients":["1/2 cup creamy peanut butter","1/3 cup Swerve (confectioners)","1/4 cup blanched almond flour","3 ounces unsweetened baking chocolate (finely chopped)","3 tablespoons Swerve (confectioners)","1 tablespoon coconut oil"],"directions":["In a bowl, combine all peanut butter ball ingredients until well-mixed and a dough is formed. If the peanut butter is too stiff to easily stir, let it soften at room temperature until it becomes more manageable.","Prepare a baking sheet lined with parchment paper. Form twelve 1-inch balls from the peanut butter mixture and arrange them in a single layer on the parchment paper. Place in the freezer for at least 30 minutes to harden. The longer you let them freeze, the easier it will be to dip them into chocolate without becoming too soft and losing their shape.","In a bowl, add all chocolate coating ingredients. Microwave in 30-second intervals, thoroughly stirring in between, until melted and smooth. Make sure you don't overheat the chocolate.","Take the peanut butter balls out of the freezer. Using toothpicks to help transfer them, dip a peanut butter ball in chocolate until coated on all sides, letting the excess drip off. Place the coated ball back on the parchment paper. Repeat until all are coated.","Refrigerate until the chocolate shell is hardened, about an hour or longer. They can be made ahead of time, and stored in the refrigerator until you're ready to serve them."],"tags":["Desserts","Quick","Truffles","Microwaving"],"label":"Keto Peanut Butter Truffles","image":"https://lh3.googleusercontent.com/tXSUGUvnu355snguAcj0AXrlr_JuumdW4F3sHFSUu2VRrU5DWHc91v_BSybDX2kx6ap7yf_IMenzVaMzRAZL-g=s640-c-rw-v1-e365","description":"These keto peanut butter truffles are easy-to-make, bite-sized low carb treats. They only require a handful of ingredients, without any baking or cooking involved.","prepTime":30,"servings":12,"source":"https://www.yummly.com/recipe/Keto-Peanut-Butter-Truffles-2678818","dateCreated":{"$date":"2019-06-23T01:57:48.374Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd128ffd282f7451f5e2"},"ingredients":["1 cup butter (room temperature)","2/3 cup light brown sugar (packed)","1 egg","1 teaspoon vanilla","2 1/2 cups flour (sifted)","1 teaspoon salt","1/2 cup granulated sugar"],"directions":["In a bowl of an electric mixer, cream the butter and brown sugar on high speed until light and fluffy, about 2 to 3 minutes.","Add the egg and vanilla, mixing thoroughly.","Gradually add the flour and salt. Mix on low speed until just combined.","On three separate sheets of plastic wrap, roll the dough into three logs 1 1/2-inches thick. Wrap in plastic and refrigerate for at least one hour to overnight.","When ready to bake, place a rack into the center of the oven and preheat to 350 degrees F.","Prepare a cookie sheet by lining it with parchment.","Remove one log from the fridge and roll it in the granulated sugar, making sure to coat it completely.","With a sharp knife, cut slices 1/4-inch thick.","Place the slices on the prepared cookie sheet 1-inch apart.","Optional – with a toothpick, make 4 decorative holes in each cookie.","Bake for about 15-20 minutes, or until lightly golden brown.","Transfer cookies to a wire rack so that they can cool completely."],"tags":["Desserts","Cookies","Browning","Baking"],"label":"French Butter Cookies","image":"https://lh3.googleusercontent.com/dUEGxkP_rg1PnaV_zeJ88_1zPFleTMytrRkrxuHLvpJ4gjjZk5-JYF39uEE2_-ouTxfLsyNpU8leMr4HiNZJP8g=s640-c-rw-v1-e365","description":"French Butter Cookies – A simple yet tasty butter cookie. Perfect for an afternoon snack or accompanying a cup of tea.","prepTime":70,"servings":33,"source":"https://www.yummly.com/recipe/French-Butter-Cookies-2242112","dateCreated":{"$date":"2019-06-23T01:59:46.691Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd268ffd282f7451f5e3"},"ingredients":["14 pounds beef brisket","1/2 cup olive oil","3 tablespoons brown sugar","3 tablespoons Mrs Dash (or other all purpose seasoning)","1 tablespoon granulated garlic","1 tablespoon black pepper","2 teaspoons kosher salt"],"directions":["Easy Smoked Brisket Recipe with our tried and true method!","Place on a large baking sheet or cutting board.","Mix together the dry rub with brown sugar, Mrs Dash Seasoning, granulated garlic, black pepper and kosher salt.","Pour olive oil over brisket and half of dry rub.","Using a large fork or a knife, pierce meat all over and work oil and rub down into the meat.","Prepare grill with hickory or oak wood for smoking. Ideal temperature is 250 degrees.","Place brisket on the grill and smoke for 3 hours, maintaining the 250 degree temperature.","Remove brisket from grill and place on a large piece of heavy duty foil on a baking sheet.","Sprinkle remaining rub over entire meaty surface.","Wrap foil to make a sealed packet.","Place in a 250 degree oven and bake for 30 minutes per pound.","You can serve the brisket immediately out of the oven or if you are making ahead, wrap tightly in plastic wrap and then foil. The plastic wrap will seal in the moisture and juices."],"tags":["Main Dishes","Easy","Low Sugar","Grilling","Low Carb"],"label":"Easy Smoked Brisket","image":"https://lh3.googleusercontent.com/Js7QBBDQumvLixXwk7wnmyArHjN7SZbOElZHwzmZrR7mjA_ElR_p2tNGAMqcmr4Ru2ei47Gi8EvX7mDZd3ii=s320-c-rw-v1-e365","description":"Easy Smoked Brisket Recipe with our tried and true method!","prepTime":55,"servings":18,"source":"https://www.yummly.com/recipe/Easy-Smoked-Brisket-2449477","dateCreated":{"$date":"2019-06-23T02:00:06.439Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd308ffd282f7451f5e4"},"ingredients":["1 pound lean ground turkey","1 garlic (minced)","1/4 onion (minced)","1 tablespoon chopped fresh cilantro (or parsley)","1 teaspoon garlic powder","1 teaspoon cumin powder","1 teaspoon kosher salt","3 red bell peppers (large sweet, washed)","1 cup fat-free chicken broth","1/4 cup tomato sauce","1 1/2 cups cooked brown rice","olive oil spray","6 tablespoons shredded cheddar cheese ( part skim )"],"directions":["Heat oven to 400°F.","Lightly spray olive oil spray in a medium nonstick skillet and heat on a medium heat.","Add onion, garlic and cilantro and saute about 2 minutes, add ground turkey, salt, garlic powder, cumin and cook meat for 4 to 5 minutes until meat is completely cooked through.","Add 1/4 cup of tomato sauce and 1/2 cup of chicken broth, mix well and simmer on low for about 5 minutes.","Combine cooked rice and meat together.","Cut the bell peppers in half lengthwise, and remove all seeds. Spoon 2/3 cup meat mixture into each pepper half and place in a 9 x 13-inch baking dish. Top each with 1 tbsp cheese.","Pour the remainder of the chicken broth on the bottom of the pan. Cover tightly with aluminum foil and bake for about 45 minutes.","Carefully remove the foil and serve right away."],"tags":["Main Dishes","Stuffed Peppers","Low Sugar","Sauteeing","Low Fat","Low Carb","Low Calorie","Baking"],"label":"Turkey Stuffed Peppers","image":"https://lh3.googleusercontent.com/hN2iD6DMAetpllqcLxwPEJu9HJVwi7mWJxmBjTQvqZRJdQGd3_1LsYu6yIWdJOtoEL11gOuNXm_n5ChcxZDUUpU=s320-c-rw-v1-e365","description":"turkey stuffed peppers filled with ground turkey and brown rice, seasoned with cumin and spices and topped with cheese","prepTime":60,"servings":6,"source":"https://www.yummly.com/recipe/Turkey-Stuffed-Peppers-2254748","dateCreated":{"$date":"2019-06-23T02:00:16.323Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd388ffd282f7451f5e5"},"ingredients":["1 box bbq sauce (KC Masterpiece®, \u0026 Dry Rub, Sweet Honey)","1 3/4 cups pineapple juice (divided)","4 boneless, skinless chicken breasts (large)","1 cup mushrooms (halved)","1 red bell pepper","1 orange bell pepper","1 cup pineapple (diced)","1 green bell pepper","1 purple onion"],"directions":["Combine 3/4 pineapple juice and 1 pouch KC Masterpiece® BBQ Sauce \u0026 Dry Rub. Set aside.","Cut chicken into bite sized pieces. In a large zipper bag combine 1 cup pineapple juice and 1 pouch KC Masterpiece® BBQ Sauce \u0026 Dry Rub and chicken. Marinate 30 minutes.","Preheat grill to medium high.","Thread chicken and vegetables onto skewers and brush with BBQ Sauce.","Grill 12-16 minutes or until cooked through."],"tags":["Main Dishes","Barbecue","Kabab","Summer","Marinating","Grilling"],"label":"Hawaiian Chicken Kabobs","image":"https://lh3.googleusercontent.com/VhFs2koEaCDU1b5MnUFduoEfUoDuwcF2CZ3N291D3p0FNF8lViOw4BbObHKiQtePZ8lgpttIkCN7mo8jRA8A84M=s320-c-rw-v1-e365","description":"Grilled Hawaiian Chicken Kabobs. Tender juicy chicken layered with a rainbow of veggies in a tangy Pineapple Honey BBQ Sauce. The perfect quick \u0026 easy summer meal!","prepTime":43,"servings":8,"source":"https://www.yummly.com/recipe/Hawaiian-Chicken-Kabobs-1683785","dateCreated":{"$date":"2019-06-23T02:00:24.264Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd408ffd282f7451f5e6"},"ingredients":["4 skinless boneless chicken breast halves","1/2 olive oil (a cup of)","3 cloves chopped garlic","1 tablespoon fresh rosemary (chopped)","1 tablespoon chopped fresh thyme","1 tablespoon fresh oregano (chopped)","4 lemons (2 juiced, 2 cut in half)"],"directions":["Pound the chicken until it's uniformly thin","In a glass dish mix olive oil, garlic, rosemary, thyme, oregano and juice of 2 lemons juice.","Place the chicken pieces in the mixture and cover.","Marinated the chicken for 2 days, or at least overnight","Preheat the grill for high heat.","Oil the grill grates well","Cut the remaining 2 lemons in half","Grilled the chicken for 3 1/2 minutes per side","Discard the marinade.","Place the 4 lemon halfs fruit side down on the grill and serve with the chicken."],"tags":["Main Dishes","Barbecue","Easy","Marinating","Grilling"],"label":"Greek Chicken","image":"https://lh3.googleusercontent.com/zeXf7IsvDJdrqsGYWXoe2RH0qgy6Wx122-4_RCPet1X2Ya1RH0aalTR371e2_VDc7rIBL826XzydDK-rH30Jqg=s320-c-rw-v1-e365","description":"I love the tang of lemony, garlicky Greek chicken. This recipe does not disappoint.","prepTime":2880,"servings":4,"source":"https://www.yummly.com/recipe/Greek-Chicken-2660694","dateCreated":{"$date":"2019-06-23T02:00:32.412Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd498ffd282f7451f5e7"},"ingredients":["1 pound ground beef","1/3 cup chopped onion","1 teaspoon dried oregano","1/2 teaspoon salt","1 cup tomato soup (canned)","1/3 cup water","2 cups noodles (cooked al dente)","1 cup shredded cheese (Cheddar or Monterey Jack are favorites)"],"directions":["Preheat the oven to 350 degrees F. ","Heat a large skillet over medium-high heat. Add the ground beef and onion and cook, stirring frequently, until the beef is cooked and the onion is soft. Drain off any excess grease.","Stir the oregano, salt, soup, water, and noodles into the skillet. Mix well.","Pour the ground beef mixture into a 1 1/2 quart casserole dish. Sprinkle the cheese evenly over the top. ","Place the casserole in the oven and bake at 350 degrees F for 25-30 minutes or until the cheese is melted and the noodles are tender. ","Serve hot."],"tags":["Main Dishes","Casserole","Low Sugar","Low Carb"],"label":"Italian Ground Beef Casserole","image":"https://lh3.googleusercontent.com/JS-90bNb0IqbFwzD5vaa5ybPnDkD6muEOHzbSqMnVy6gl9Y3rPsL0GEti6IVmu3mLINVTmtlsVkgETiKkws4sw=s320-c-rw-v1-e365","description":"Italian Ground Beef Casserole","prepTime":40,"servings":4,"source":"https://www.yummly.com/recipe/Italian-Ground-Beef-Casserole-2659612","dateCreated":{"$date":"2019-06-23T02:00:41.139Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd508ffd282f7451f5e8"},"ingredients":["1 cup rolled oats (old-fashioned)","1/4 cup ground flaxseed","1/4 cup sliced almonds (chopped)","2 tablespoons chia seeds","1/8 teaspoon cinnamon","1 pinch salt","1/4 cup creamy peanut butter (melted and slightly cooled)","1/4 cup honey","1/4 teaspoon vanilla extract","2 tablespoons mini chocolate chips","1/4 cup peanuts (ground, or ground almonds, to roll the balls in)"],"directions":["Combine oats, almonds, flaxseed, chia seeds, salt and cinnamon in a large bowl and stir.","Melt peanut butter and allow it to cool slightly (I melted mine in the microwave for about 30 seconds, then stirred), then stir in honey and vanilla extract until it’s combined. Once peanut butter has cooled a bit, pour it over the oat mixture and mix well with a spoon then bring together with your hands. Once mixture is sticking together, fold in chocolate chips.","Roll dough into golf-ball sized (or slightly smaller) balls, then roll in ground peanuts or ground almonds. These can be eaten at room temp but we really like them stored in the fridge!"],"tags":["Desserts","Quick and Easy","Quick","Easy"],"label":"Bake Oatmeal Peanut Butter Bites","image":"https://lh4.ggpht.com/GTyKZDmS5HGEPY2IG2MdQEdTOJ-7VlpXO-Z9FR1bkIzq9uSqbKtrwhGYcJrs_h5Raw0prTq2i1mjEBmw79_yG2Q=s320-c-rw-v1-e365","description":"QUICK + EASY NO BAKE OATMEAL PEANUT BUTTER BITES","prepTime":10,"servings":14,"source":"https://www.yummly.com/recipe/Quick-_-easy-no-bake-oatmeal-peanut-butter-bites-333288","dateCreated":{"$date":"2019-06-23T02:00:48.893Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd5a8ffd282f7451f5e9"},"ingredients":["1 pound ground chicken breast","1/4 cup sharp cheddar cheese (finely grated)","1 teaspoon smoked paprika","1/2 teaspoon onion powder","1/4 teaspoon garlic powder","1/4 teaspoon black pepper","1/4 teaspoon salt","1/4 cup bbq sauce (– use homemade or your favorite!)","4 whole wheat buns","1 onion (sliced)","1 tablespoon olive oil","bbq sauce (for topping)","gouda cheese (for topping)"],"directions":["In a large bowl, combine chicken, BBQ sauce, paprika, onion and garlic powder, salt, pepper and cheddar cheese. Mix until just combined, then form 4 patties. Preheat the grill or a skillet and cook the burgers until fully cooked through. I used a skillet and cooked mine about 8 minutes per side – they were juicy and not dried out, but cooked thoroughly.","While burgers are cooking, heat a skillet on medium heat and add olive oil. Add sliced onions with a pinch of salt and saute until caramelized, about 10 minutes.","When burgers are ready, top with gouda (or more cheddar), onions, BBQ sauce and fresh romaine. I also toast the buns!"],"tags":["Main Dishes","Barbecue","Burger","Summer","Sauteeing","American","Grilling"],"label":"Bbq Chicken Burgers","image":"https://lh5.ggpht.com/v5E26L2XIcf9oiSMIZLL1Eaphn9bVYsaVoN1vCx6klwHrfDJvxf44V4P_QprQp-VVQ42yUZVIj_H0b2TG_U4XQ=s320-c-rw-v1-e365","description":"Bbq Chicken Burgers","prepTime":40,"servings":4,"source":"https://www.yummly.com/recipe/Bbq-Chicken-Burgers-2485477","dateCreated":{"$date":"2019-06-23T02:00:58.264Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd628ffd282f7451f5ea"},"ingredients":["1 carne asada (recipe)","2 avocados","3 tablespoons cotija cheese","1/3 cup onion (finely diced)","1/2 cup fresh cilantro (chopped)","6 tortillas (I’m using my cassava flour tortillas recipe)","limes (for garnish)"],"directions":["Grill the carne asada until it's cooked to your preference. Slice it against the grain, then chop it into small pieces.","Use a spoon to mash the avocado, then spread a large spoonful or two onto each tortilla","Top the avocado with chopped carne asada, a sprinkle of cotija cheese, some diced onion and fresh cilantro. Squeeze fresh lime juice on top."],"tags":["Main Dishes","Quick and Easy","Tacos","Grilling","Quick","Easy"],"label":"Carne Asada Tacos","image":"https://lh3.googleusercontent.com/NmWpTku-nBfeT7Ia4FCQrpoAVWGSElpbXwwklHwWOgV3hCYG1ANsX1WocnSYFOcn4cwlkVosBme5VMc_9BXlWA=s320-c-rw-v1-e365","description":"Carne asada tacos are delicious, flank steak tacos with a few simple ingredients and tons of flavor. Just add some avocado, onion, cotija cheese and cilantro to the grilled steak for authentic carne asada tacos, similar to the street tacos you’d find in Mexico.","prepTime":30,"servings":6,"source":"https://www.yummly.com/recipe/Carne-Asada-Tacos-2466830","dateCreated":{"$date":"2019-06-23T02:01:06.719Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd728ffd282f7451f5eb"},"ingredients":["6 tablespoons unsalted butter (softened to room temperature 85g)","2/3 cup canola oil (or vegetable oil 160ml)","2 cups sugar (400g)","1 tablespoon vanilla extract (clear)","2 2/3 cups all purpose flour (345g)","1 tablespoon baking powder","1 teaspoon salt","1 cup milk (room temperature preferred, 235ml)","6 large egg whites (room temperature)","1 batch buttercream frosting (Vanilla)"],"directions":["Preheat oven to 350F and prepare two 8-inch round cake pans by lining the bottoms with a round of parchment paper and generously greasing and flouring the sides. Be sure to shake out excess flour.","In a stand mixer (or using an electric mixer), beat butter on medium-low speed until creamy.","Add sugar and oil and beat until all ingredients are well-combined and creamy.","Scrape down the sides and bottom of the bowl and then stir in your vanilla extract.","In separate bowl, whisk together your flour, baking powder, and salt.","Measure out your milk.","With mixer on medium speed, gradually alternate between adding the flour mixture and the milk, starting and ending with the flour mixture. Stir until each one is almost completely combined before adding the next.","Pause occasionally to scrape down sides and bottom of bowl.","In separate bowl, combine your egg whites and, with a hand-mixer on high-speed, beat until stiff peaks form.","Using a spatula, gently fold your egg whites into your batter. Take care to scrape the sides and bottom of the bowl so that ingredients are well-combined, and take care not to over-mix.","Evenly divide cake batter into prepared pans.","Bake on 350F for 35-40 minutes, or until a toothpick inserted in the center of each cake layer comes out clean or with few crumbs (should not be wet). For best results, rotate your cake pans halfway through baking to ensure even baking.","Cakes will be a light golden brown when done baking.","Remove cakes from oven and allow to cool for 15 minutes. Run a knife around the inside rim of each pan and invert each onto a cooling rack.","Allow to cool completely before covering with buttercream frosting*.  I used a double batch of my recipe (linked above) to thoroughly cover and decorate this cake."],"tags":["Desserts","Cake"],"label":"The Best White Cake","image":"https://lh3.googleusercontent.com/z0lv6CSMp2I7bokaBBx9DErCPcsmY8P51gXjPoq3gwiZRj7R2nOChw5slrL0Ftz_9cT22elt4qALGrhAuBmfhw=s320-c-rw-v1-e365","description":"This recipe yields a fluffy, snow-white cake that’s light and soft but still sturdy enough to stack or cover with fondant. Read on for plenty of tips for making the perfect white cake, completely from scratch!","prepTime":60,"servings":4,"source":"https://www.yummly.com/recipe/The-Best-White-Cake-2564183","dateCreated":{"$date":"2019-06-23T02:01:22.007Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd7e8ffd282f7451f5ec"},"ingredients":["8 ounces cream cheese (package, room temp)","8 tablespoons unsalted butter (room temp)","3 cups powdered sugar","1/2 cup unsweetened cocoa powder","1/4 teaspoon salt","1 teaspoon vanilla extract"],"directions":["In the bowl of an electric mixer using paddle attachment (or using an electric hand mixer with a large bowl), beat together 8 oz cream cheese with 8 Tbsp butter on medium/high speed until creamy (3 min), scraping down the bowl as needed.","Sift in 3 cups powdered sugar with 1/2 cup cocoa powder to ensure there are no lumps then add 1/4 tsp salt. Mix on low speed until well combined, scrape down the bowl well then increase to medium/high speed and beat until smooth and whipped (1 min).","Add 1 tsp vanilla and beat on medium/high until smooth (1 min). Now it's ready to be piped onto cooled cupcakes."],"tags":["Desserts","Quick","frosting"],"label":"Chocolate Cream Cheese Frosting","image":"https://lh3.googleusercontent.com/TMk8ci5b34EiC2E1LB1Dx7K5vXWiB3zlrLS_v0Be-Nnk37iRNXjl2Dy6w-xEhIcCGekxtkXEXZ2Ik4Zhq3lJ5Ek=s320-c-rw-v1-e365","description":"This chocolate cream cheese frosting is a chocolate lovers dream. This chocolate frosting is silky smooth, surprisingly easy to make, and pipes onto cupcakes or cakes beautifully.","prepTime":8,"servings":3,"source":"https://www.yummly.com/recipe/Chocolate-Cream-Cheese-Frosting-2425072","dateCreated":{"$date":"2019-06-23T02:01:34.428Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd858ffd282f7451f5ed"},"ingredients":["2 tablespoons oil (30 mL)","2 cups white rice (350 g)","1/2 cup white onion (chopped)","2 cloves garlic (minced)","3 cups vegetable broth (720 mL)","1 cup salsa (240 g)","15 ounces kidney beans (drained and rinsed, 425 g)"],"directions":["Toast Rice: Heat oil in a large saute pan over medium/high. Add rice and toast until the grains begin to turn golden brown, stirring often, about 7 minutes.","Add Flavor Makers: Reduce heat to medium and add onion and garlic, continuing to cook until onion is soft.","Cook Til Tender: Add broth, cover, and cook until rice is tender and broth is absorbed. About 15 minutes.","Finish: Stir in salsa then beans and serve warm."],"tags":["Side Dishes","Quick and Easy","Sauteeing","Quick","Easy","Low Sugar","Browning"],"label":"Spanish Rice and Beans","image":"https://lh3.googleusercontent.com/w0G8HY3CRZmjA60EM1o8GzVkjThhKXpqWGciPTGLCBjarK9HMbcG9aMJ6BOiEFfyJmqgudjIH8O-WZRBnu4h=s320-c-rw-v1-e365","description":"This easy vegan Spanish Rice and Beans recipe is quick to whip up and is a great source of complete proteins!","prepTime":27,"servings":6,"source":"https://www.yummly.com/recipe/Spanish-Rice-and-Beans-814","dateCreated":{"$date":"2019-06-23T02:01:41.490Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd8d8ffd282f7451f5ee"},"ingredients":["2 cups zucchini (packed freshly shredded raw)","1 large egg","1/4 cup shredded parmesan cheese (freshly)","1/8 teaspoon black pepper","1/4 cup almond flour (superfine, you can use all purpose flour if you are not doing strict low carb)"],"directions":["Preheat oven to 450°F. Line a large baking sheet with parchment paper.","Add zucchini to a large bowl and let sit 10-15 minutes. Drain excess water from zucchini bowl. Using a cheesecloth or several sturdy paper towels, add in 1/2 cup of zucchini into towel and wring dry. Repeat with remaining zucchini. When you are finished, you should have about 1 cup of zucchini remaining.","Add zucchini, egg, cheese, pepper and flour to a large mixing bowl. Mix until all ingredients are thoroughly combined.","Dump zucchini mixture onto baking sheet lined with parchment paper. Using a spatula, thin and spread out the batter so that it forms a round crust approximately 9 inches in diameter and 1/8 inch thick.","Bake in oven about 15-20 minutes or until edges are golden brown and both sides are cooked. Flip over crust and bake an additional 10 minutes until top is crispy. Flip pizza crust back over.","Lower oven temperature to 400°F. Add whatever pizza ingredients you desire to your crust. I did a layer of marinara sauce, followed by fresh slices of mozzarella, sliced bell peppers and fresh basil leaves. Bake for about 8-10 minutes or until cheese is melted. Serve immediately."],"tags":["Main Dishes","pizza","Low Sugar","Browning","Low Sodium","Low Fat","Low Carb","Low Calorie","Baking"],"label":"Zucchini Crust Pizza","image":"https://lh3.googleusercontent.com/A73bKQwtga6CKmw9aGD_-9nkQnMyHfzzusq2HQDRhl7cuIVdwF5mqcofl2fsSyXRQJ7O8k1_M9s0lKlzmhBt2Q=s320-c-rw-v1-e365","description":"This low carb zucchini crust pizza is crispy, delicious and a great way to add more vegetables to your diet.","prepTime":60,"servings":4,"source":"https://www.yummly.com/recipe/Zucchini-Crust-Pizza-2690350","dateCreated":{"$date":"2019-06-23T02:01:49.936Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edd988ffd282f7451f5ef"},"ingredients":["1 pound 85% lean ground beef","1/2 pound ground veal (or more beef)","1/2 pound ground pork","2 eggs","3/4 cup panko bread crumbs","1/4 cup ketchup (for meatloaf mixture)","1 tablespoon Worcestershire sauce","2 teaspoons dijon mustard","1 teaspoon garlic powder","1/2 teaspoon onion powder","1/2 teaspoon dried oregano","1 3/4 teaspoons black pepper (salt)","8 strips bacon","ketchup (for serving)"],"directions":["Preheat the oven to 400° F.","Line a baking sheet with parchment paper.","Place all the ingredients except for the bacon in a large mixing bowl. Using clean hands, work the ingredients together until combined into a uniform mixture.","Divide the mixture into 8 baseball-sized balls (roughly 5 oz. each), and shape into small loaves. Arrange the loaves on the baking sheet.","Wrap a strip of bacon around each individual meatloaf, making sure the ends are on the underside of the loaf. Return the meatloaves to the baking sheet.","Transfer the baking sheet to the middle rack of the preheated oven.","Bake the meatloaves for 30-35 minutes, until the bacon is browned and crisp, and the meat is cooked through.","Remove the baking sheet from the oven.","Plate the meatloaves and serve immediately."],"tags":["Main Dishes","Low Sugar","Browning","Low Sodium","Low Carb","Low Calorie","Baking"],"label":"Individual Bacon-Wrapped Meatloaves","image":"https://lh3.googleusercontent.com/tB1cCQIHzugOMfw_EpOrwLLr98ePJNeBsVmUidHWuIPq3aoKsgxWhX56_DA2Yf8hs_5mMzi3BvDs028zUOtV=s320-c-rw-v1-e365","description":"Your family will love these perfectly portioned meatloaves wrapped in crispy bacon. Easy to make and fun to eat!","prepTime":40,"servings":8,"source":"https://www.yummly.com/recipe/Individual-Bacon-Wrapped-Meatloaves-2436592","dateCreated":{"$date":"2019-06-23T02:02:00.613Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edda18ffd282f7451f5f0"},"ingredients":["5 pounds fryer chicken (whole, giblets removed)","1 onion (medium-sized, chopped into large pieces)","3 carrots (chopped into large pieces)","3 celery stalks (chopped into large pieces)","pepper","salt","2 cups all-purpose flour","1/2 teaspoon baking powder","1 pinch salt","2 tablespoons butter (I used Earth Balance)","1 cup milk (maybe a little less, I used skim)"],"directions":["For the chicken: Place chicken, onion, carrots and celery into a very large soup or stock pot. Add enough water to cover the chicken. Bring to a heavy boil, then lower the heat to a simmer. Place a lid on top and cook for an hour, flipping the chicken halfway through. Carefully remove the chicken to a plate.","Strain the chicken broth through a large strainer lined with cheese cloth. Discard the vegetables and reserve 8 cups broth for the dish. Store the remaining broth in the refrigerator.","Remove meat off the chicken and shred. Reserve 3 cups for the dish and store the remaining meat in the refrigerator.","For the dumplings: Combine flour, baking powder and salt in a large bowl. Cut the butter into the flour using a pastry blender, a fork, or your fingers. Add milk about 1/4 cup at a time, stirring between batches, until the dough comes together in a ball.","Working in batches, place the dough onto a heavily floured work surface. Flour a rolling pin, and roll the dough out thin. Don't be afraid to keep adding more flour. If you don't, the dough will stick to the board or counter. Using a pizza cutter, cut the dough into approximately 2\" x 2\" squares.","Flour a large plate or platter to place the dumplings on while you roll and cut out the rest of the dough. Generously sprinkle flour between each layer as you place them on the platter so they don't stick together.","For the rest of the dish: Bring 8 cups chicken broth to a boil and add dumplings in one at a time while gently stirring to prevent them from sticking together. Don't worry about too much flour from the dumplings getting into the broth. The more that gets in there, the thicker the sauce will be.","Cook dumplings for 10-15 minutes, stirring occasionally and more often towards the end so they don't stick to the bottom of the pot. When dumplings are cooked, turn off the heat and add in 3 cups shredded chicken. Season with more salt \u0026 pepper to taste, and serve."],"tags":["Main Dishes","Dumplings","Low Sugar","Chicken and Dumplings"],"label":"Homemade Chicken \u0026 Dumplings","image":"https://lh3.ggpht.com/ISit0_4H44TMvvwkBA_s_wdyHG81RLzSxfsae_JHpI7GmwmznFb0MJ_rRvSFf7VKPaWhJpENnXlvDzstaX2y4qw=s320-c-rw-v1-e365","description":"Homemade Chicken \u0026 Dumplings is the ultimate comfort food dish, especially perfect on a cold wintery day. ","prepTime":105,"servings":5,"source":"https://www.yummly.com/recipe/Homemade-Chicken-_-Dumplings-475242","dateCreated":{"$date":"2019-06-23T02:02:09.530Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0edda88ffd282f7451f5f1"},"ingredients":["1 block extra firm tofu (pressed, cut into cubes)","3 tablespoons hoisin sauce","1 tablespoon soy sauce","1 tablespoon chives (finely chopped)","2 pinches red pepper flakes","olive oil (for sauteeing)"],"directions":["Combine Hoisin sauce with soy sauce, chives and red pepper flakes. Add cubed tofu and marinate for at least 20 minutes.","Heat olive oil in a non-stick pan and saute cubed tofu until it's golden on all sides. The Hoisin sauce will give the tofu it's sticky and sweet quality; while the red pepper flakes will add some spice."],"tags":["Quick and Easy","Low Sugar","Sauteeing","Quick","Easy","Low Sodium","Low Carb","Low Calorie","Marinating"],"label":"Sweet, Sticky \u0026 Spicy Tofu","image":"https://lh3.ggpht.com/SCmYYDxQRK7OTKxcA4Kap8AVmgKlsylKFfwVVybCREtuauYOqG44QvG8He9OUUkbWy1qQnenGVT_ncwoSlfzAA=s320-c-rw-v1-e365","description":"This recipe for Sweet, Sticky \u0026 Spicy Tofu is one of my most popular recipes on the blog and for a good reason. Not only is it quick to make, but it screams with a variety of flavors and can be eaten on top of rice or salad. ","prepTime":30,"servings":5,"source":"https://www.yummly.com/recipe/Sweet_-sticky-_-spicy-tofu-330885","dateCreated":{"$date":"2019-06-23T02:02:16.804Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eddb88ffd282f7451f5f3"},"ingredients":["1/2 cup coconut flour","1/4 cup sugar substitute (Lakanto, or Swerve sugar substitute)","1/2 teaspoon baking powder","1/2 teaspoon salt","6 eggs","1/4 cup coconut oil (or butter, melted)","3/4 cup coconut milk (or another non-dairy milk)","1 teaspoon vanilla extract (optional)"],"directions":["In a large bowl combine the coconut flour, Lakanto sugar substitute, baking powder, and salt.","In a separate bowl combine the eggs, oil, and coconut milk. Then, add the wet ingredients into the dry and whisk until a smooth batter is formed. Allow the batter to rest at room temperature for 10 minutes, this will allow the coconut flour to fully absorb all the liquid. ","After 10 minutes, heat a medium nonstick skillet over medium heat. I allow my pan to separate dry for about 4 minutes.","Once the pan is hot, grease with a little bit of butter or coconut oil, then using a 1/3 cup measure, spoon the batter into the pan, gently swirling the medium in a circular motion until batter is evenly distributed across the pan.","Allow the crepe to cook for about 3-4 minutes on the first side. When the medium is ready to flip there will be tiny bubbles all over and the edges of the crepe will be golden brown.","Using a large flat spatula, gently loosen the crepe from the pan then flip over. These crepes are actually more flexible than traditional ingredients so don't worry about them breaking when flipping or folding over.","Allow the crepe to cook on the second side for about 1-2 minutes. Remove from the pan and place on a large plate. Repeat the process until you've used all the batter. ","To serve, fold 2-3 crepes into triangles and top with Lakanto Maple Flavored Syrup and fresh berries if desired. Enjoy!","Cover and store the crepes in the fridge for up to 2 days. They re-heat nicely in a pan over low heat or in the microwave."],"tags":["Breakfast and Brunch","Quick","Crepes","microwaving","Browning"],"label":"Easy Keto Crepes","image":"https://lh3.googleusercontent.com/o_HRdnJ45dSosjPuWxCHJBTSOn9o5U8xm7mP5F-9tQ7mtjgZkE3Xh-DXJQA1n1_5IzYdsh9kUuD3b3PCKkNRvA=s320-c-rw-v1-e365","description":"Completely sugar-free and low carb, My Keto Crepes are rich and sweet with the added value of healthy fats and the best coconutty aroma!","prepTime":20,"servings":4,"source":"https://www.yummly.com/recipe/Easy-Keto-Crepes-2630076","dateCreated":{"$date":"2019-06-23T02:02:32.747Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eddc18ffd282f7451f5f4"},"ingredients":["2 cups flour (all-purpose)","2 teaspoons baking powder","1/2 teaspoon salt","1/4 cup butter (melted)","1/4 cup oil","3/4 cup granulated sugar","2 large eggs","1 teaspoon vanilla","3/4 cup milk","2 cups blueberries fresh (or frozen)","2/3 cup flour (all-purpose)","1/3 cup granulated sugar","1/8 teaspoon salt","4 tablespoons butter (melted)"],"directions":["Heat oven to 375 degrees. Line muffin tins with baking cups or grease well with cooking spray.","In a medium bowl, mix together the flour, baking powder and salt. Set aside.","In a large bowl, mix together the butter, oil, and sugar with a fork until smooth. Add the eggs, vanilla, and milk and mix well until combined.","Add the flour mixture into the liquid mixture and stir just until most of the streaks of flour are incorporated. Fold in the blueberries, being careful not to smash them. If using frozen blueberries, do not defrost before adding them to the batter.","Fill each baking cup 3/4 full, then add a few extra blueberries on the top of each muffin, if desired. Mix the flour, sugar, salt, and melted butter together in a medium bowl using a fork for the crumb topping, then divide evenly among the muffins, sprinkling about 1 tablespoon of the top of each muffin before baking.","Bake for 22-25 minutes, until done. Cool for 5-10 minutes before transferring to a wire rack to cool completely."],"tags":["Breads","Muffins","Baking"],"label":"Homemade Blueberry Muffins with Crumb Topping","image":"https://lh3.googleusercontent.com/I_bO7WWYzzrXuRHBqmbNkc1Q6D1kyc6yrg9z9FkwvU6TdrMPuohzbNOh2tViBVbqYB0frSs_Rl5R41EIYUOV=s320-c-rw-v1-e365","description":"othing beats Homemade Blueberry Muffins with Crumb Topping and a large glass of cold milk!  Bursting with fresh blueberry muffin flavor and topped with a sweet crumb topping, these really are the best blueberry muffins ever!  You can make these blueberry muffins with frozen blueberries if fresh ones aren't available or are out of season and crazy expensive.","prepTime":32,"servings":4,"source":"https://www.yummly.com/recipe/Homemade-Blueberry-Muffins-with-Crumb-Topping-2183810","dateCreated":{"$date":"2019-06-23T02:02:41.891Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eddc98ffd282f7451f5f5"},"ingredients":["1 3/4 cups all purpose flour","2 teaspoons baking powder","1/4 teaspoon salt","1 tablespoon sugar","2 large eggs","1 1/4 cups whole milk","4 tablespoons unsalted butter (melted)","1 cup blueberries fresh (or frozen, thawed if frozen)","vegetable oil (for the pan)"],"directions":["In a medium-size mixing bowl, whisk together all your dry ingredients","In a separate bowl, whisk together all of the wet ingredients until the egg is broken up.","Add the wet ingredients to the dry ingredients and add the blueberries. Gently stir until you stop seeing flour. Be careful not to overmix, that will make the batter tough. Leave a few lumps for tender pancakes.","Place your a large non-stick pan over a medium-high flame and let the surface get hot. It's hot enough when you sprinkle a few droplets of water over the surface and they evaporate.","Moisten a paper towel with vegetable oil and lightly wipe the bottom of the pan. This will keep the pancakes from sticking.","For each pancake, gently pour 1/2 cup of batter into the pan, using a ladle or a measuring cup. Use the back of a spoon to spread the batter into a circle.","Bubbles will form in the batter. When they begin to pop, the pancakes are ready to be flipped. Turn over gently with the spatula and cook for about one minute on the flip side."],"tags":["Breakfast and Brunch","Pancakes","Low Sodium"],"label":"Easy Blueberry Pancakes","image":"https://lh4.ggpht.com/nScilHVgIxNPn85qyKZqL3zERSlkpVAtTXiGZkpp57p2FGJoI5lK2fdno1q0h72MKY2LO1BbRzWBdhz5Z7xLtA=s320-c-rw-v1-e365","description":"You only need one recipe for blueberry pancakes","prepTime":30,"servings":4,"source":"https://www.yummly.com/recipe/Easy-Blueberry-Pancakes-511199","dateCreated":{"$date":"2019-06-23T02:02:49.271Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0eddd08ffd282f7451f5f6"},"ingredients":["4 cups cauliflower rice","8 ounces sharp cheddar cheese (* shredded)","10 eggs","1 teaspoon salt","1/4 teaspoon pepper","1 teaspoon smoked paprika","1/2 cup heavy whipping cream","12 ounces bacon (* cooked and crumbled)"],"directions":["ou won’t even miss the potatoes when you try this Keto Breakfast Casserole! It’s made with bacon, egg, cheese, and riced cauliflower to keep it at only 5 carbs per serving, yet deliciously satisfying. It’s an easy recipe to whip up for breakfast, brunch, or dinner!","Spread the riced cauliflower evenly into the casserole dish.","Top with half of the sharp cheddar cheese.","Whisk together the eggs, salt, pepper, smoked paprika, and heavy whipping cream. Pour evenly over the cauliflower.","Top with remaining cheese and all of the crumbled bacon.","Bake for 45 minutes, or until set in the middle and lightly browned on top."],"tags":["Breakfast and Brunch","Casserole","Low Sugar","Browning","Breakfast Casserole","Low Carb","Baking"],"label":"Keto Breakfast Casserole","image":"https://lh3.googleusercontent.com/wpeRHHQHYW6qEtlKaT4awEcprTY82ALqk2XVBiTfguVb1QQN4WNbjDZ-N5O_rsUNBkPNdxqbjIVVc5DrUwUD9A=s320-c-rw-v1-e365","description":"You won’t even miss the potatoes when you try this Keto Breakfast Casserole! It’s made with bacon, egg, cheese, and riced cauliflower to keep it at only 5 carbs per serving, yet deliciously satisfying. It’s an easy recipe to whip up for breakfast, brunch, or dinner!","prepTime":60,"servings":4,"source":"https://www.yummly.com/recipe/Keto-Breakfast-Casserole-2670598","dateCreated":{"$date":"2019-06-23T02:02:56.114Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
{"_id":{"$oid":"5d0ee4f08ffd282f7451f5f7"},"ingredients":["1 fresh pineapple (peeled, cored and chopped)","1 cup almond milk (or non-dairy milk of choice)","1 tablespoon honey (optional, for authentic sweetness)"],"directions":["In a high-speed blender or food processor, combine the frozen pineapple, almond milk and honey, if using, then blend until a smooth, ice-cream-like texture is achieved.","For an authentic Dole Whip presentation, transfer the frozen dessert to a large plastic bag, and cut off the tip to create a piping bag. Pipe the pineapple whip into 4-6 dishes, and serve immediately!","Any leftovers can be frozen in an ice cube tray and used in smoothies later."],"tags":["Quick","Blending"],"label":"Pineapple Whip","image":"https://lh3.googleusercontent.com/sVQabRdBdupkbnhm0jV_DE3MDGXUMknC_3SDKdI9gceNoMhkc3-OF9BObbvs9WFc-O1mAgNvZF7EzvBjz6gGBQ=s320-c-rw-v1-e365","description":"with the consistency of soft-serve ice cream. It’s amazingly delicious! It’s also pretty difficult to come by, unless you’re visiting Disneyland or the Dole Plantation in Hawaii.","prepTime":5,"servings":4,"source":"https://www.yummly.com/recipe/Pineapple-Whip-2201319","dateCreated":{"$date":"2019-06-23T02:33:20.888Z"},"author":{"$oid":"5cc5dd34f1d5ef4ac8fe2b8f"},"__v":0}
